[
  {
    "title": "Sizzling Hot Deluxe",
    "thumbnail": "https://static.casino.guru/pict/782/Sizzling-Hot-Deluxe.png?timestamp=1653449167000&imageDataId=214488&width=320&height=247",
    "rating": 7.4,
    "images": [],
    "overview": "Sizzling Hot Deluxe\n    \n        Play Sizzling Hot Deluxe demo slot online for fun. Enjoy free casino games in demo mode on Casino Guru. Expert review included.",
    "about_game": "Sizzling Hot Deluxe takes the old style high-variance fruit machine, gives it a digital polish and puts it back more or less as it was. This hyper-simple slot is for the players who think bonus games distract and free spins are for spongers.",
    "game_informations": {
      "game_developer": "Novomatic",
      "progressive_jackpot": false,
      "configurable_winlines": false,
      "bonus_feature": false,
      "free_spins": false,
      "autoplay": true,
      "quickspin_feature": false,
      "gamble_feature": true,
      "number_of_winlines": "5",
      "layout": "3-3-3-3-3",
      "min_bet": "$10",
      "max_bet": "$1,000",
      "release_date": "January 2007",
      "last_update": "07 Feb 2022"
    },
    "game_provider": {
      "title": "Novomatic",
      "slug": "novomatic"
    },
    "game_stats": {
      "return_to_player": "95.66%",
      "game_type": "Slots",
      "payout_system": "Winlines"
    },
    "game_tags": [
      {
        "title": "Fruits",
        "slug": "fruits"
      },
      {
        "title": "Classics and retro",
        "slug": "classics-and-retro"
      },
      {
        "title": "5-Reels",
        "slug": "5-reels"
      }
    ],
    "game_src": "https://casinoguru-en.com/embedGame?identifier=6e4f894c-4e04-46fe-8583-0a5a668bc044",
    "game_review": {
      "Theme and Storyline": {
        "text": "Sizzling Hot Deluxe is a throwback in a new style; the game is a classic fruit machine but updated for the 21st Century.\nThe symbols are classic lemons, melons, etc… (including of course the slot machine staple – the cherry) and some lucky sevens for the big wins.\nSizzling Hot Deluxe carries over that old school attitude into its gameplay and odds. More on that below.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/50579/sizzling-hot-deluxe-high-def-design.png?imageDataId=28025&timestamp=1653398112000",
            "alt": "Sizzling Hot Deluxe has HD design",
            "caption": "Sizzling Hot Deluxe slot machine has HD design"
          }
        ]
      },
      "Sizzling Hot Deluxe Gameplay": {
        "text": "The gameplay is almost belligerently simple. You push a button and you either win or lose. There are no bonus rounds, no wild symbols, no free spins.\nThe only concession to modernity is the option to play a double or nothing Gamble feature when you win allowing you to up your variance. Even then the gamble feature is a simple red/black game where you have to predict the colour of the next card drawn by the random number generator.\nWhat you are left with is more or less an unadorned five reel, five win-line slot. You can’t even adjust the number of win-lines.",
        "media": []
      },
      "Graphics, Sounds and Animations": {
        "text": "The graphics are excellent. Simple, classic designs, with enough flair to make them feel modern but not to undercut the minimalist vibe of the game.\nThe animations are smooth and high def and your spins are accompanied by a satisfying clunking noise as if there were real mechanical wheels turning behind the screen. This also comes with the classic bell sounds of old slot machines and a satisfying win noise.\nAll in all the design is admirable.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/50580/sizzling-hot-deluxe-gamble-feature.png?imageDataId=28026&timestamp=1653398112000",
            "alt": "Sizzling Hot Deluxe offers a gamble feature",
            "caption": "Sizzling Hot Deluxe slot offers standard gamble feature"
          }
        ]
      },
      "Wilds, Bonuses and Free Spins in Sizzling Hot Deluxe": {
        "text": "This is a pretty short section! The closest thing to a bonus the game has is the scatter feature which pays out a nice multiple of your bet amount (either 2x for three symbols, 10x for four symbols and 50x for five).\nBut if you are a fan of the change of pace and big wins that bonuses and free spins provide, you need to look elsewhere.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/50581/sizzling-hot-deluxe-only-5-win-lines.png?imageDataId=28027&timestamp=1653398112000",
            "alt": "Only 5 winlines in Sizzling Hot Deluxe",
            "caption": "There are only 5 winlines in Sizzling Hot Deluxe slot"
          }
        ]
      },
      "Sizzling Hot Deluxe Bet Sizes, RTP and Variance": {
        "text": "The return to player on this slot if 95.66%, which is pretty run of the mill for the slot industry.\nThis average RTP is accompanied by high-variance. The game pays out very rarely (and often the minimal 4 times your bet amount). But every now and again you’ll get lucky and smash one of the big wins out of the park.\nAs a result bets ranged from £/€/$0.10 to £/€/$50.00 at the site we tested.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/50582/sizzling-hot-deluxe-paytable.png?imageDataId=28028&timestamp=1653398112000",
            "alt": "Paytable of Sizzling Hot Deluxe slot",
            "caption": "Full paytable of Sizzling Hot Deluxe slot"
          }
        ]
      },
      "Conclusion": {
        "text": "Sizzling Hot Deluxe does what it does perfectly. Unfortunately, what it does is very basic. As a result, it is a great machine for those who like their slots simple. But might disappoint if you are used to playing the modern slot machines with all the bells, whistles and trappings.\nIt is nice to look at, sounds great, and if you’re not expecting it to blow your mind with clever side games and flashy bonuses then it could be the perfect slot for you.",
        "media": [
          {
            "type": "video",
            "url": "https://www.youtube.com/embed/Mduh9_DT0_o",
            "caption": "Gameplay video"
          }
        ]
      }
    }
  },
  {
    "title": "Rainbow Riches",
    "thumbnail": "https://static.casino.guru/pict/779/Rainbow-Riches.png?timestamp=1653471066000&imageDataId=270861&width=320&height=247",
    "rating": 7.85,
    "images": [],
    "overview": "Rainbow Riches\n    \n        Play Rainbow Riches demo slot online for fun. Enjoy free casino games in demo mode on Casino Guru. Expert review included.",
    "about_game": "Rainbow Riches is a Leprechaun based slot that comes with three different bonus games. Unfortunately, the game fails to impress with its other features and its 95% RTP.",
    "game_informations": {
      "game_developer": "Barcrest",
      "progressive_jackpot": false,
      "configurable_winlines": true,
      "bonus_feature": true,
      "free_spins": false,
      "autoplay": true,
      "quickspin_feature": false,
      "gamble_feature": false,
      "number_of_winlines": "20",
      "layout": "3-3-3-3-3",
      "min_bet": "$1",
      "max_bet": "$500",
      "release_date": "May 2009",
      "last_update": "30 May 2024"
    },
    "game_provider": {
      "title": "Barcrest",
      "slug": "barcrest"
    },
    "game_stats": {
      "return_to_player": "95%",
      "game_type": "Slots",
      "payout_system": "Winlines"
    },
    "game_tags": [
      {
        "title": "Irish",
        "slug": "irish"
      },
      {
        "title": "5-Reels",
        "slug": "5-reels"
      },
      {
        "title": "Fairy tales",
        "slug": "fairy-tales"
      }
    ],
    "game_src": "https://casinoguru-en.com/embedGame?identifier=f281825b-b16f-446e-900c-cffa43280c66",
    "game_review": {
      "Theme and Storyline": {
        "text": "Everyone knows if you catch one of the aos sí fairies they’ll lead you to the pot of gold at the rainbow. Which is where you’re hoping this slot is going to lead you.\nRainbow Riches is based around a Leprechaun (who appears as one of the Bonus symbols), and other light-hearted Irish myths of wishing wells and hidden treasures.\nIt's a fun theme that isn’t really capitalised on with the background being a sickly purple landscape of fields with a rainbow mostly obscured by the reels.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/51896/rainbow-riches-stacked-symbols.png?imageDataId=28056&timestamp=1653398166000",
            "alt": "Rainbow Riches stacked symbols",
            "caption": "Reels have stacked symbols in Rainbow Riches slot"
          }
        ]
      },
      "Graphics, Sounds and Animations": {
        "text": "Like the background, the symbols chosen to illustrate the theme are a bit naff. The art is kitsch at best and tacky at worst and doesn’t do much to work with the fun idea of Leprechauns, rainbows and gold.\nThe sound design is perfectly fine but rather uninspiring. The slot is silent until the spin button is pushed when it makes a quick harp noise and a few desultory clunks.\nIt isn’t the worst designed slot we’ve ever seen, but it's not much fun to look at.",
        "media": []
      },
      "Gameplay": {
        "text": "The main gameplay is a 20 winline, five reel Barcrest slot. You can choose how many of the 20 lines you want to play which gives you some control over variance and bankroll considerations.\nThe main draw from a gameplay standpoint are the multiple bonus games (more on these below).\nBeyond that, the gameplay is pretty bog-standard.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/51897/rainbow-riches-wild-symbols-win.png?imageDataId=28057&timestamp=1653398167000",
            "alt": "Rainbow Riches win with Wilds",
            "caption": "Rainbow Riches Wild symbols win"
          }
        ]
      },
      "Wilds, Bonuses and Free Spins": {
        "text": "The game comes with four special symbols a Wild symbol and three different bonus symbols. The Wild plays as any symbol except for the bonus symbols.\nYou can trigger any of the three bonuses by hitting three of the relevant symbol on one spin.\nThe first bonus is the Pots of Gold symbols. Hit three of these and you get to play a wheel of fortune style wheel spin game. Wherever the wheel stops you win the value written there.\nWith the Wishing Well feature, you are presented with a bunch of wells, you chose one to reveal how much that well is worth and your bet is multiplied by the value of the well.\nThe Road to Riches feature is slightly different. You roll an eight-sided dice to see how many steps you move. You can move between 1 and 6 steps or you have two chances of hitting \"collect\", which would end the feature and you would receive your total spin bet multiplied with number you reached. Multipliers can vary depending on your casino, they should be between 1 and 200.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/51898/rainbow-riches-bonus-features.png?imageDataId=28058&timestamp=1653398167000",
            "alt": "Rainbow Riches bonus features",
            "caption": "Bonus features explanation"
          }
        ]
      },
      "Bet Sizes, RTP and Variance": {
        "text": "The RTP of this game is 95%, which is a bit below average. It certainly doesn’t impress and counts as a minor black mark against the game.\nThe variance on the game is medium, there are opportunities for big wins, and of course, by playing fewer lines you can increase your variance considerably if that is your preference (you can find some high-variance game strategies in our strategy section).\nThe site we tested allowed a minimum bet of £/€/$0.01 which should cater for even the lowest of rollers. While the maximum bet was a whopping £/€/$500.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/51899/rainbow-riches-top-symbols-paytable.png?imageDataId=28059&timestamp=1653398167000",
            "alt": "Rainbow Riches top symbols paytable",
            "caption": "Highest paying symbols paytable"
          }
        ]
      },
      "Conclusion": {
        "text": "Overall Rainbow Riches has some nice bonus features but is on the whole not a very fun experience. The design looks shoddy, there’s very little sound to generate atmosphere and the RTP and variance are both middling.",
        "media": [
          {
            "type": "video",
            "url": "https://www.youtube.com/embed/x8CRf14qUt0",
            "caption": "Gameplay video"
          }
        ]
      }
    }
  },
  {
    "title": "40 Super Hot",
    "thumbnail": "https://static.casino.guru/pict/768/40-Super-Hot.png?timestamp=1653449887000&imageDataId=220708&width=320&height=247",
    "rating": 7.85,
    "images": [],
    "overview": "40 Super Hot\n    \n        Play 40 Super Hot demo slot online for fun. Enjoy free casino games in demo mode on Casino Guru. Expert review included.",
    "about_game": "40 pay lines and classic fruit machine style makes 40 Super Hot an exciting high variance game. If you’re looking for bells and whistles look elsewhere but if you like your games streamlined this might be the one for you.",
    "game_informations": {
      "game_developer": "Amusnet (EGT)",
      "progressive_jackpot": true,
      "configurable_winlines": false,
      "bonus_feature": false,
      "free_spins": false,
      "autoplay": true,
      "quickspin_feature": false,
      "gamble_feature": true,
      "number_of_winlines": "40",
      "layout": "5-5-5-5-5",
      "min_bet": "$40",
      "max_bet": "$2,400",
      "release_date": "January 2015",
      "last_update": "30 May 2024"
    },
    "game_provider": {
      "title": "Amusnet (EGT)",
      "slug": "amusnet-(egt)"
    },
    "game_stats": {
      "return_to_player": "95.81%",
      "game_type": "Slots",
      "payout_system": "Winlines"
    },
    "game_tags": [
      {
        "title": "Fruits",
        "slug": "fruits"
      },
      {
        "title": "Classics and retro",
        "slug": "classics-and-retro"
      },
      {
        "title": "5-Reels",
        "slug": "5-reels"
      }
    ],
    "game_src": "https://casinoguru-en.com/embedGame?identifier=9a48ac02-ca75-43c8-8446-d308bed0d33f",
    "game_review": {
      "Theme and Storyline": {
        "text": "40 Super Hot is one of many examples of the slot genre: \"fruit machine plus\". Here the \"plus\" comes in the form of extra symbols – the game plays out on a five-by-four grid instead of the usual three or four reel fruit machines.\nBeyond that, there is very little story to play with.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/51172/stacked-symbols.png?imageDataId=28031&timestamp=1653398113000",
            "alt": "40 Super Hot stacked symbols",
            "caption": "40 Super Hot slot has stacked symbols on the reels"
          }
        ]
      },
      "Graphics, Sounds and Animations": {
        "text": "The graphics are pleasant. The dark background and bright symbols contrast nicely and are animated smoothly. Those animations can be very long-winded, especially while counting up a multi-win line payout. This can be easily countered, however, by simply hitting the spin button again to skip the animations and jump to the next round as soon as possible.\nThe sound design is mostly clicky reels and electric bells for completed spins and it all works well with the theme. There is no background music to distract the player.\nAll in all, it is a well-crafted slot from the visual angle.",
        "media": []
      },
      "Gameplay": {
        "text": "Gameplay is pretty basic. The game plays out on five reels of four symbols each and symbols are stacked on all reels making for rarer wins. When you do hit, it tends to be across numerous winlines making for some nice payouts.\nThere are forty of those win lines to hit, hence the \"40\" in the name, and the betting system is based around this, taking forty coins as a minimum bet.\nWhen you do win, you can add some variance by playing the Gamble feature. Like many simpler slots of this nature, the gamble feature is a simple game of red or black where you predict the colour of the next card off the deck for double or nothing.",
        "media": [
          {
            "type": "video",
            "url": "https://www.youtube.com/embed/-Q9lwWUz3Qw",
            "caption": "Gameplay video"
          },
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/51171/40-super-hot-gamble-function.png?imageDataId=28030&timestamp=1653398113000",
            "alt": "Gamble function",
            "caption": "You can add to the game's variance with the gamble function"
          }
        ]
      },
      "Wilds, Bonuses and Free Spins": {
        "text": "There are a few special symbols in this game. The Lucky 7s play as symbols in their own right (the most valuable symbol in the game for single line payouts) but also act as Wild symbols for other lines, substituting for all symbols except the Scatter symbol.\nThis Scatter symbol makes for the really big payouts, a bet of one coin per line (forty coins per spin) it pays out 200 coins for hitting three one any combination of reels, and up to 20,000 coins for hitting five Scatter symbols.\nThere are no free spins or bonus games in 40 Super Hot.\nThe game does, however, have a progressive jackpot feature, which is common for most games from EGT. If you like slots with this feature, feel free to check out other progressive slot machines or other games from EGT.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/51170/40-super-hot-big-win.png?imageDataId=28029&timestamp=1653398113000",
            "alt": "Big Win",
            "caption": "You can rack up some nice winnings if you hit many of the stacked symbols in 40 Super Hot slot machine"
          }
        ]
      },
      "Bet Sizes, RTP and Variance": {
        "text": "The RTP of 40 Super Hot is 95.81%. This is smack bang around the rough industry average and so doesn’t particularly count for or against the game.\nAs stated earlier the stacked symbols make for a high-variance game, so make sure to account for that in your bet sizing and bankroll requirements. High variance works well with some of our favoured strategies.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/51173/40-super-hot-paytable.png?imageDataId=28032&timestamp=1653398160000",
            "alt": "40 Super Hot paytable",
            "caption": "Full paytable of 40 Super Hot slot"
          }
        ]
      },
      "Conclusion": {
        "text": "40 Super Hot is a solid, simple, slot machine that doesn’t do a lot but does it well.\nWe like its high variance (and the gamble feature that allows you to increase it further) and the RTP is within acceptable bounds (if a little lower than we would normally like).\nOverall playing 40 Super Hot is a positive experience.",
        "media": []
      }
    }
  },
  {
    "title": "Zeus",
    "thumbnail": "https://static.casino.guru/pict/793/Zeus.png?timestamp=1653450669000&imageDataId=222602&width=320&height=247",
    "rating": 7.19,
    "images": [],
    "overview": "Zeus\n    \n        Play Zeus demo slot online for fun. Enjoy free casino games in demo mode on Casino Guru. Expert review included.",
    "about_game": "Despite this slots widespread popularity, it is old fashioned and unvolatile, this slot is best given a miss. There’s plenty more Zeus based slots out there.",
    "game_informations": {
      "game_developer": "WMS",
      "progressive_jackpot": false,
      "configurable_winlines": true,
      "bonus_feature": false,
      "free_spins": true,
      "autoplay": true,
      "quickspin_feature": false,
      "gamble_feature": false,
      "number_of_winlines": "30",
      "layout": "3-3-3-3-3",
      "min_bet": "$0.3",
      "max_bet": "$150",
      "release_date": "January 2014",
      "last_update": "30 May 2024"
    },
    "game_provider": {
      "title": "WMS",
      "slug": "wms"
    },
    "game_stats": {
      "return_to_player": "95.97%",
      "game_type": "Slots",
      "payout_system": "Winlines"
    },
    "game_tags": [
      {
        "title": "Mythology",
        "slug": "mythology"
      },
      {
        "title": "Medieval",
        "slug": "medieval"
      },
      {
        "title": "5-Reels",
        "slug": "5-reels"
      }
    ],
    "game_src": "https://casinoguru-en.com/embedGame?identifier=672bc51c-75a7-4fed-b0aa-ade2f029bf51",
    "game_review": {
      "Theme and Storyline": {
        "text": "Zeus, the Greek lord of thunder, son of Kronos the Titan, and King of the Olympian Gods gets a lot of lead time in various slots. But this was the one that won the trademark to be simply called \"Zeus\".\nThe reels are adorned with various ancient Greek artefacts. Bireme ships, silver drachmae printed with (ironically) the Owl of Athena, pots, and fringed helmets. And of course, a fist grasping a bolt of lightning.\nOff the reels, the theme is hinted at by a stylised acropolis at the top, while the rest of the screen is a plain sky blue gradient, suggesting ethereal heights.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/174830/zeus-wms-high-paying-symbol-win.png?imageDataId=189967&timestamp=1653433683000",
            "alt": "Zeus (WMS) - High paying symbol win",
            "caption": "Bih win with the highest paying symbol of the Zeus slot"
          }
        ]
      },
      "Graphics, Sounds and Animations": {
        "text": "The graphics are pretty simple, and a touch Microsoft Paint-ish. As a result, it looks decidedly dated; like a relic from the early to mid-2000s. Which isn’t necessarily a downside if you like the style.\nThe sounds aren’t very atmospheric and seem to be a standard set of spin and win sounds for WMS slots rather than tailored to the theme.\nThe animations are similarly basic, with flashing lines to indicate wins, and a basic animation for spins. All in all, the front end of this slot is beginning to show its age.",
        "media": []
      },
      "Gameplay": {
        "text": "Zeus is a five reel, three row slot with up to thirty winlines. The player has the option of adjusting the win lines in increments of one all the way up to thirty. This gives pretty granular control over volatility and bet size.\nThere is a single bonus game (see below for details) and no gamble feature.\nSo this slot has the basics in place, but nothing extra.",
        "media": []
      },
      "Wilds, Bonuses and Free Spins": {
        "text": "The Wild symbol substitutes for all symbols except the Scatter symbol.\nScatter doesn’t pay out, but three or more anywhere on the reels will trigger the Free Spins Feature. Three Scatters will award the player 10 free spins, four Scatters win 25 spins, and five wins 100.\nDuring the Free Spins, the reels are adjusted but payouts remain the same. Free Spins can be retriggered by hitting three or more Scatters again with additional spins being added to the player’s total.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/174834/zeus-wms-stacked-wilds.png?imageDataId=189971&timestamp=1653433683000",
            "alt": "Zeus (WMS) stacked Wild symbol",
            "caption": "Wild symbol is stacked on reels in free spins bonus"
          }
        ]
      },
      "Bet Sizes, RTP and Variance": {
        "text": "The return to player of this game is 95.97%, more or less exactly equal to our yardstick for average of roughly 96%.\nThe range of bets on the site we tested ran from a minimum bet per spin of $/£/€0.30 up to a maximum of $/£/€150.00 per spin.\nThe volatility of this game is medium, which makes it a weak match for our preferred slot machine strategies. Our slot strategies target the highest possible volatility.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/174831/zeus-wms-paytable.png?imageDataId=189968&timestamp=1653433683000",
            "alt": "Zeus (WMS) paytable",
            "caption": "Paytable for high paying symbols of the game"
          }
        ]
      },
      "Conclusion": {
        "text": "Zeus was a nice slot once upon a time. But it feels a little creaky nowadays. Though it remains hugely popular. The art style is old fashioned, the animations and sound is paper-thin, and there are barely enough features to keep a modern player interested.\nThe RTP is alright – right around our estimated average – but the medium volatility doesn’t appeal much.\nWhen it’s all put together, there are far more interesting slots based around this exact deity to enjoy. Give one of them a try instead.",
        "media": []
      }
    }
  },
  {
    "title": "Fruit Warp",
    "thumbnail": "https://static.casino.guru/pict/2590/Fruit-Warp.png?timestamp=1653460625000&imageDataId=248697&width=320&height=247",
    "rating": 9.08,
    "images": [],
    "overview": "Fruit Warp\n    \n        Play Fruit Warp demo slot online for fun. Enjoy free casino games in demo mode on Casino Guru. Expert review included.",
    "about_game": "Fruit Warp might be one of the oddest slots we’ve played in a while but that’s what makes it great. Match up three or more fruit in the void and win big. With a medium volatility and an RTP of 97%, this might be the game for you.",
    "game_informations": {
      "game_developer": "Thunderkick",
      "progressive_jackpot": false,
      "configurable_winlines": false,
      "bonus_feature": true,
      "free_spins": true,
      "autoplay": true,
      "quickspin_feature": false,
      "gamble_feature": false,
      "min_bet": "$0.1",
      "max_bet": "$100",
      "release_date": "January 2014",
      "last_update": "02 May 2024"
    },
    "game_provider": {
      "title": "Thunderkick",
      "slug": "thunderkick"
    },
    "game_stats": {
      "return_to_player": "97%",
      "game_type": "Slots",
      "payout_system": "Winlines"
    },
    "game_tags": [
      {
        "title": "Fruits",
        "slug": "fruits"
      }
    ],
    "game_src": "https://casinoguru-en.com/embedGame?identifier=65891025-2537-457c-acea-677f2d4b62b3",
    "game_review": {
      "Theme and Storyline": {
        "text": "Fruit Warp’s not your average slot. It does away entirely with the whole reel or grid structure, it has no cutesy characters or complex bonus games.\nInstead, it features an eerie, but strangely beautiful void from which 9 pieces of fruit emerge as if flung out by the eldritch greengrocer of the abyss.\nWhat bizarre mind constructed this, we don’t know. But it is hard not to fall immediately for its simple and elegant mechanics and visuals.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/46046/all-symbols-win-combination.png?imageDataId=27932&timestamp=1653398041000",
            "alt": "3 wins combination",
            "caption": "Without winlines you can win with up to 3 sets of fruits"
          }
        ]
      },
      "Graphics, Sounds and Animations": {
        "text": "The game is 3D modelled in a way that allows the fruit to come arcing up at you in a lazy parabola. Once they arrive in front of you they spin slowly in place until warped out of existence by the next spin.\nThe sound design is basic, with a slightly annoying marimba track you might want to mute if you’ll be playing for a while.\nBut in all other ways, the game takes full advantage of the Thunderkick slot software.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/46049/game-spin.png?imageDataId=27935&timestamp=1653398042000",
            "alt": "Game spin",
            "caption": "Even simple spin looks different in this game without reels"
          }
        ]
      },
      "Gameplay": {
        "text": "As described above the gameplay the game throws a random selection of nine fruits at you rather than dealing with reels and symbols on a grid.\nIf you hit three or more of the same fruit the game pays out.",
        "media": [
          {
            "type": "video",
            "url": "https://www.youtube.com/embed/ZcTTdwq84Io",
            "caption": "Gameplay video"
          },
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/46050/bonus-games-rules.png?imageDataId=27936&timestamp=1653398042000",
            "alt": "Bonus game rules",
            "caption": "Explanation how bonus works"
          }
        ]
      },
      "Wilds, Bonuses and Free Spins": {
        "text": "If you manage to hit four of the same kind of fruit a portal zaps the other fruit out of existence and triggers a respin of those fruit.\nHit five or more and you trigger one of the fruit mode bonuses. Each fruit mode is a slightly different set of bonuses and multipliers that are triggered when you hit more of the same kind of specific fruit. The game continues until a spin happens without the fruit mode’s specific fruit appearing.\nIn each fruit mode every time you hit one of the mode’s fruit you earn a combination of lives, which allow you to ignore a spin where there are none of the specific fruit, and multipliers which are applied to your total win at the end of the bonus feature.\nEach type of fruit provides a different combination of lives and multipliers with the rarest fruit giving the best rewards during bonuses.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/46048/respin-bonus-feature.png?imageDataId=27934&timestamp=1653398042000",
            "alt": "Respin bonus feature",
            "caption": "If you hit 4 of the same fruits you get the respin feature which gives you big chance for a Fruit game"
          },
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/46047/bonus-game.png?imageDataId=27933&timestamp=1653398042000",
            "alt": "Bonus game",
            "caption": "Hitting the special symbol of a bonus game raises the multiplier for your bonus winnings"
          }
        ]
      },
      "Bet Sizes, RTP and Variance": {
        "text": "As well as its visual appeal the game has a relatively low vig of 3% which is attractive enough and goes well with the medium-level volatility of the game.\nThe range of bets is not bad £/$/€0.10 to £/$/€100 per spin. Obviously, without win lines, there is no way to manipulate volatility nor to affect bet size more subtly than by simply changing the coin size.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/46051/low-symbols-paytable.png?imageDataId=27937&timestamp=1653398042000",
            "alt": "Low symbols paytable",
            "caption": "Low symbols paytable"
          },
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/46052/mid-symbols-paytable.png?imageDataId=27938&timestamp=1653398043000",
            "alt": "Middle symbols paytable",
            "caption": "Mid symbols paytable"
          },
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/46053/high-symbols-paytable.png?imageDataId=27939&timestamp=1653398043000",
            "alt": "High symbols paytable",
            "caption": "Top symbols paytable"
          }
        ]
      },
      "Conclusion": {
        "text": "For anyone looking for a medium volatility slot, this can be strongly recommended with its decent RTP (97.0%) and innovative style and gameplay. This slot is great fun.\nIf you wish to play Fruit Warp for real money, you can find good Thunderkick casinos in our list available here.",
        "media": []
      }
    }
  },
  {
    "title": "Starburst",
    "thumbnail": "https://static.casino.guru/pict/2566/Starburst.png?timestamp=1653449170000&imageDataId=218131&width=320&height=247",
    "rating": 9.55,
    "images": [],
    "overview": "Starburst\n    \n        Play Starburst demo slot online for fun. Enjoy free casino games in demo mode on Casino Guru. Expert review included.",
    "about_game": "Starburst is one of the better looking slots, with simple gameplay and some nice innovation with its Wild/Bonus symbol and two-way winlines. It has a low volatility and an RTP of 96.1%.",
    "game_informations": {
      "game_developer": "NetEnt",
      "progressive_jackpot": false,
      "configurable_winlines": true,
      "bonus_feature": true,
      "free_spins": false,
      "autoplay": true,
      "quickspin_feature": true,
      "gamble_feature": false,
      "number_of_winlines": "10",
      "layout": "3-3-3-3-3",
      "min_bet": "$10",
      "max_bet": "$100",
      "release_date": "November 2013",
      "last_update": "30 May 2024"
    },
    "game_provider": {
      "title": "NetEnt",
      "slug": "netent"
    },
    "game_stats": {
      "return_to_player": "96.10%",
      "game_type": "Slots",
      "payout_system": "Winlines"
    },
    "game_tags": [
      {
        "title": "Gems and diamonds",
        "slug": "gems-and-diamonds"
      },
      {
        "title": "5-Reels",
        "slug": "5-reels"
      },
      {
        "title": "Money and wealth",
        "slug": "money-and-wealth"
      }
    ],
    "game_src": "https://casinoguru-en.com/embedGame?identifier=85772661-ed77-41c0-94ad-5d61c8021311",
    "game_review": {
      "Theme and Story Line": {
        "text": "Starburst does not appear to have much in the way of story or theme. The symbols are slot machine staples: lucky sevens, bar symbols, and a selection of gems.\nThe background suggests a night sky or outer space. It is all very bright and upbeat.",
        "media": []
      },
      "Graphics, Sounds and Animations": {
        "text": "The tone of the slot machine is very cheerful, the electronic soundtrack is a little drifty. The background is animated with gently drifting stars and the symbols on the reels seem to hang in a purple space-like void.\nThe visuals are all very high def, so much that they can slow your browser a bit as if the software is struggling to keep up.\nThe design is full of little details, gem symbols are all animated to twinkle, and you can scroll over the winlines to make them visible.\nThis is something we've come to expect from NetEnt slots, as most of their games have amazing visuals and animations that many players enjoy. There are plenty of exciting games to choose from, and if you are on the lookout for more, just head over to our game section or visit DogSlots that also offer a nice collection of free NetEnt titles for you to try out.",
        "media": []
      },
      "Gameplay": {
        "text": "There are technically ten winlines. You can play as many lines from one to ten as you please, according your personal taste. It is worth noting that unlike most games the winlines read both right to left and left to right. This means you can win with combos that start in either reel one or reel five.\nThis significantly increases your chance of hitting a payout, but obviously will not affect the stated RTP of 96.1% and you can only win once per winline.\nThe high quality graphics and interface definitely add to the experience making the gameplay more immersive, smooth and fun that it might otherwise have been.\nThe reels are also stacked so that several symbols can fall at once, making combo wins much more likely.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/30602/starburst-right-to-left-winline.png?imageDataId=27676&timestamp=1653397740000",
            "alt": "Starburst Right To Left Winline",
            "caption": "Winlines read from both sides in Starburst"
          },
          {
            "type": "video",
            "url": "https://www.youtube.com/embed/HMgiHeTWtAM",
            "caption": "Gameplay video with two Wild reels win"
          }
        ]
      },
      "Wilds, Bonuses and Free Spins": {
        "text": "Starburst uses a special Wild symbol as its bonus trigger. In place of a bonus game or free spins the Wild symbol triggers the following sequence:\nWhen the wild symbol hits on a reel, that reel is frozen and wild symbol expands to the whole reel.\nOnce the payouts for that spin are complete, then a free spin begins with the wild reels remaining fixed. As a result you are allowed to win twice with all Wild reels. If you hit any further Wilds they trigger a further free spin with all the Wild reels still locked in place.\nThe Wild symbols only appear on reels two, three and four and their frequency does not change during the free spin.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/30603/starburst-wilds.png?imageDataId=27681&timestamp=1653397741000",
            "alt": "Starburst Wilds",
            "caption": "Starburst's bonus feature - expandable Wild symbol and free spin"
          },
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/30604/starburst-free-spin-win.png?imageDataId=27682&timestamp=1653397742000",
            "alt": "Starburst Free Spin win",
            "caption": "Win with two Wild reels from the right side"
          }
        ]
      },
      "Bet Sizes, RTP and Variance": {
        "text": "The RTP of Starburst is 96.1% according to the design team.\nThe both-way winlines and stacked symbols make for regular small wins, generating relatively low volatility.\nThere is a massive range of possible bet sizes running from €/£/$0.01 to €/£/$100. The three different controls for deciding the amount per spin coin value (€/£/$ value per coin), lines (number of lines) and the additional setting of level (number of coins per line) give you a great deal of control over exactly what value you want to bet each spin.\nThere is a maximum payout per spin of 50,000 coins, though obviously such large wins will be very rare.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/30605/starburst-paytable.png?imageDataId=27683&timestamp=1653397742000",
            "alt": "Starburst Paytable",
            "caption": "Starburst's paytable and winlines"
          },
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/30606/starburst-maxbet-setting.png?imageDataId=27684&timestamp=1653397742000",
            "alt": "Starburst MaxBet Setting",
            "caption": "Bet controls offer wide range of bets."
          }
        ]
      },
      "Conclusion": {
        "text": "Starburst is a very attractive game to look at and it comes with some interesting variations with its frozen Wild symbol bonus and its both-way winlines.\nWe like many aspects of this game, the simple clean gameplay design in particular.\nUnfortunately, the average RTP and low volatility make it more suitable for casual slot players. Our strategies work better with high volatility games.",
        "media": []
      }
    }
  },
  {
    "title": "Esqueleto Explosivo",
    "thumbnail": "https://static.casino.guru/pict/2612/Esqueleto-Explosivo.png?timestamp=1653460623000&imageDataId=248687&width=320&height=247",
    "rating": null,
    "images": [],
    "overview": "Esqueleto Explosivo\n    \n        Play Esqueleto Explosivo demo slot online for fun. Enjoy free casino games in demo mode on Casino Guru. No download required.",
    "about_game": "Esqueleto Explosivo is a slot machine by Thunderkick. According to the number of players searching for it, Esqueleto Explosivo is not a very popular slot. Still, that doesn't necessarily mean that it's bad, so give it a try and see for yourself, or browse popular casino games.To play for free in demo mode, just load the game and press the 'Spin' button. You can learn more about slot machines and how they work in our online slots guide.",
    "game_informations": {
      "game_developer": "Thunderkick",
      "progressive_jackpot": false,
      "configurable_winlines": false,
      "gamble_feature": false
    },
    "game_provider": {
      "title": "Thunderkick",
      "slug": "thunderkick"
    },
    "game_stats": {
      "return_to_player": "96%",
      "game_type": "Slots",
      "payout_system": "Winlines"
    },
    "game_tags": [
      {
        "title": "Holiday",
        "slug": "holiday"
      },
      {
        "title": "Music",
        "slug": "music"
      },
      {
        "title": "Horror and scary",
        "slug": "horror-and-scary"
      },
      {
        "title": "5-Reels",
        "slug": "5-reels"
      },
      {
        "title": "Fairy tales",
        "slug": "fairy-tales"
      }
    ],
    "game_src": "https://casinoguru-en.com/embedGame?identifier=50378b73-be38-4e06-988f-ec351c2ad72f",
    "game_review": null
  },
  {
    "title": "Birds On A Wire",
    "thumbnail": "https://static.casino.guru/pict/2632/Birds-on-a-Wire.png?timestamp=1653460620000&imageDataId=248669&width=320&height=247",
    "rating": null,
    "images": [],
    "overview": "Birds On A Wire\n    \n        Play Birds On A Wire demo slot online for fun. Enjoy free casino games in demo mode on Casino Guru. No download required.",
    "about_game": "Birds on a Wire is a slot machine by Thunderkick. According to the number of players searching for it, Birds on a Wire is not a very popular slot. Still, that doesn't necessarily mean that it's bad, so give it a try and see for yourself, or browse popular casino games.To play for free in demo mode, just load the game and press the 'Spin' button. You can learn more about slot machines and how they work in our online slots guide.",
    "game_informations": {
      "game_developer": "Thunderkick",
      "progressive_jackpot": false,
      "configurable_winlines": false,
      "bonus_feature": false,
      "free_spins": true,
      "autoplay": true,
      "quickspin_feature": false,
      "gamble_feature": false,
      "number_of_winlines": "17",
      "layout": "3-3-3-3-3",
      "min_bet": "$0.1",
      "max_bet": "$100",
      "release_date": "January 2014"
    },
    "game_provider": {
      "title": "Thunderkick",
      "slug": "thunderkick"
    },
    "game_stats": {
      "return_to_player": "96%",
      "game_type": "Slots",
      "payout_system": "Winlines"
    },
    "game_tags": [
      {
        "title": "Animals",
        "slug": "animals"
      },
      {
        "title": "5-Reels",
        "slug": "5-reels"
      }
    ],
    "game_src": "https://casinoguru-en.com/embedGame?identifier=093524b1-31a7-476d-b9b3-dfbc339845ac",
    "game_review": null
  },
  {
    "title": "Arcader",
    "thumbnail": "https://static.casino.guru/pict/2640/Arcader.png?timestamp=1653460567000&imageDataId=248650&width=320&height=247",
    "rating": null,
    "images": [],
    "overview": "Arcader\n    \n        Play Arcader demo slot online for fun. Enjoy free casino games in demo mode on Casino Guru. No download required.",
    "about_game": "Arcader is a slot machine by Thunderkick. According to the number of players searching for it, Arcader is not a very popular slot. Still, that doesn't necessarily mean that it's bad, so give it a try and see for yourself, or browse popular casino games.To play for free in demo mode, just load the game and press the 'Spin' button. You can learn more about slot machines and how they work in our online slots guide.",
    "game_informations": {
      "game_developer": "Thunderkick",
      "progressive_jackpot": false,
      "configurable_winlines": false,
      "bonus_feature": false,
      "free_spins": true,
      "autoplay": true,
      "quickspin_feature": false,
      "gamble_feature": false,
      "number_of_winlines": "15",
      "layout": "3-3-3-3-3",
      "min_bet": "$0.1",
      "max_bet": "$100",
      "release_date": "January 2014"
    },
    "game_provider": {
      "title": "Thunderkick",
      "slug": "thunderkick"
    },
    "game_stats": {
      "return_to_player": "96.10%",
      "game_type": "Slots",
      "payout_system": "Winlines"
    },
    "game_tags": [
      {
        "title": "Fruits",
        "slug": "fruits"
      },
      {
        "title": "Classics and retro",
        "slug": "classics-and-retro"
      },
      {
        "title": "5-Reels",
        "slug": "5-reels"
      }
    ],
    "game_src": "https://casinoguru-en.com/embedGame?identifier=25077eb1-f5ea-48e8-971f-54238d990a7e",
    "game_review": null
  },
  {
    "title": "Pixies of the Forest",
    "thumbnail": "https://static.casino.guru/pict/2660/Pixies-of-the-Forest.png?timestamp=1653471122000&imageDataId=270890&width=320&height=247",
    "rating": 7.01,
    "images": [],
    "overview": "Pixies of the Forest\n    \n        Play Pixies of the Forest demo slot online for fun. Enjoy free casino games in demo mode on Casino Guru. Expert review included.",
    "about_game": "A well designed game that is fun to play if a bit busy to look at, Pixies of the Forest comes with five reels, tumblers, bonuses and wild symbols. The key selling point is 99 winlines for 33 coins, a design that lowers volatility, but leaves the RTP at an unimpressive 94.9%.",
    "game_informations": {
      "game_developer": "IGT",
      "progressive_jackpot": false,
      "configurable_winlines": false,
      "bonus_feature": false,
      "free_spins": true,
      "autoplay": true,
      "quickspin_feature": false,
      "gamble_feature": false,
      "number_of_winlines": "99",
      "layout": "3-3-3-3-3",
      "min_bet": "$33",
      "max_bet": "$6,600",
      "release_date": "January 2012",
      "last_update": "30 May 2024"
    },
    "game_provider": {
      "title": "IGT",
      "slug": "igt"
    },
    "game_stats": {
      "return_to_player": "94.90%",
      "game_type": "Slots",
      "payout_system": "Winlines"
    },
    "game_tags": [
      {
        "title": "Nature",
        "slug": "nature"
      },
      {
        "title": "5-Reels",
        "slug": "5-reels"
      },
      {
        "title": "Fairy tales",
        "slug": "fairy-tales"
      }
    ],
    "game_src": "https://casinoguru-en.com/embedGame?identifier=3897679e-7482-42bf-8569-447041b94da2",
    "game_review": {
      "Theme and Story Line": {
        "text": "This follow up or expansion of the Secrets of the Forest slot and is based around magical woodland nymphs; the gaming symbols being a combination of the pixies the game is named for and, for less obvious reasons, the letters A, Q, K for the top three card rankings in a standard deck.\nThere is little additional plot to go with the theme, but the forest backgrounds are nicely designed and the theme of magical wish granting fairies that might do you mischief seems like a perfect metaphor for gambling in general.",
        "media": []
      },
      "Graphics, Sounds and Animations": {
        "text": "The animations are smooth and high end and the soundtrack of magical chimes, giggling fairies and bird song works with the theme nicely.\nThe main problem is the busyness of the fairy icons. Most slots have this issue when it comes to more elaborate themes, but here the slightly garish and noisy parts of the screen aren’t too bothersome.\nAll in all its rather well put together visually.",
        "media": []
      },
      "Gameplay": {
        "text": "The gameplay is fairly standard with several, but unimaginative features.\nThe main innovation is that there are a full 99 winlines across 5 reels, which can be played with just 33 coins. This makes for plenty of ways to win, but of course it's a gimmick, since the extra lines do little to change the winrate.\nThe variation in the games pacing is provided by the ability to win bonus spins, and the now universal tumbling feature. This keeps the game moving but is an average set of features for modern slots.\nI’d say it make for enough variation to keep one engaged, but a few innovations wouldn’t hurt.",
        "media": [
          {
            "type": "video",
            "url": "https://www.youtube.com/embed/pNbHkWV3IMQ",
            "caption": "Pixies of the Forest free spins gameplay video"
          }
        ]
      },
      "Wilds, Bonuses and Free Spins": {
        "text": "The bonus spins mentioned above can be won by by getting 3 Bonus symbols on a winline. There are Wild symbols on reels 2, 3 and 4 in the main game. Extra Wilds are then added to reels 1-4 during Bonus spins. The additional Wild symbols on a bonus reel makes for an even higher rate of wins, so hitting the Bonuses becomes the best way to make a big win.\nBefore the bonus rounds there is a short minigame in which the player clicks on tiles to reveal additional bonus spins or multipliers.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/28111/pixies-of-the-forest-bonus-paytable.png?imageDataId=1030&timestamp=1653382992000",
            "alt": "Pixies of the Forest Bonus Paytable",
            "caption": "Pixies of the Forest bonus paytable"
          }
        ]
      },
      "Bet Sizes, RTP and Variance": {
        "text": "Although you get a lot of winlines for your 33 coins, the range of betting is limited (1 coin per line up to 33 coins per line), but that is countered by the range of values you can place on the coin. The website we tested allowed a variation from £0.01 up to £1.00.\nThe number of winlines makes for a low volatility game with frequent small payouts which should keep anyone with a small bankroll in the game for a while (especially when coupled with the winline to coin ratio).\nHowever, if you do manage to hit the biggest single line jackpot of 2000x you could turn your €/£/$33.00 total bet into €/£/$2,000. That being said, your entire win would be quite a lot higher in this case, as you will hit some wins on other winlines as well. And the other hits can add up quite nicely, since this slot machine has a high number of winlines.\nThe RTP of this game is a maximum of 94.90% which is rather low, and the low volatility makes many of the strategies we suggest on this site unplayable.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/28112/pixies-of-the-forest-paytable.png?imageDataId=1032&timestamp=1653382992000",
            "alt": "Pixies of the Forest Paytable",
            "caption": "Pixies of the Forest paytable"
          }
        ]
      },
      "Conclusion": {
        "text": "Overall the game is nicely put together visually. It is also solid but unimaginative in its gameplay. Low volatility, and 99 winlines for 33 coins might appeal to those with a small gaming bankroll. But this would put off any player using the strategies we recommend.",
        "media": []
      }
    }
  },
  {
    "title": "Cleopatra",
    "thumbnail": "https://static.casino.guru/pict/2656/cleo.png?timestamp=1653450421000&imageDataId=221490&width=320&height=247",
    "rating": 7.62,
    "images": [],
    "overview": "Cleopatra\n    \n        Play Cleopatra demo slot online for fun. Enjoy free casino games in demo mode on Casino Guru. Expert review included.",
    "about_game": "Cleopatra is a massively popular classic. A five reel, twenty winline slot with a decent but uninspired design and a poor RTP (95.02%). The volatility of this slot is low to medium.",
    "game_informations": {
      "game_developer": "IGT",
      "progressive_jackpot": false,
      "configurable_winlines": true,
      "bonus_feature": false,
      "free_spins": true,
      "autoplay": true,
      "quickspin_feature": false,
      "gamble_feature": false,
      "number_of_winlines": "20",
      "min_bet": "$20",
      "max_bet": "$10,000",
      "release_date": "January 2012",
      "last_update": "30 May 2024"
    },
    "game_provider": {
      "title": "IGT",
      "slug": "igt"
    },
    "game_stats": {
      "return_to_player": "95.02%",
      "game_type": "Slots",
      "payout_system": "Winlines"
    },
    "game_tags": [
      {
        "title": "Egypt",
        "slug": "egypt"
      },
      {
        "title": "5-Reels",
        "slug": "5-reels"
      }
    ],
    "game_src": "https://casinoguru-en.com/embedGame?identifier=bf178b46-a069-4115-8ee7-2b769e5a84f7",
    "game_review": {
      "Theme and Story Line": {
        "text": "\"The barge she sat in, like a burnish'd throne, Burn'd on the water: the poop was beaten gold; Purple the sails, and so perfumed that The winds were love-sick with them\" - From Antony and Cleopatra by William Shakespeare\nCleopatra, the seductress of Julius Caesar, Mark Antony and the Roman imagination is the ostensible theme of this slot machine. With Egyptian designs and a pseudo near east soundtrack.\nWhile Classical Egypt is a fun theme, to which slot machines go back again and again, the theme is really nominal more than anything else. There is not much of a story going on as you play.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/29676/cleopatra-low-pay-win.png?imageDataId=27639&timestamp=1653397682000",
            "alt": "Cleopatra Low-pay Win",
            "caption": "Small win on a low volatility Cleopatra slot"
          }
        ]
      },
      "Graphics, Sounds and Animations": {
        "text": "The graphics are nice. The designs are bright but not garish and evoke a kind of cartoon idea of Egypt and the opulence of Cleopatra’s rule. They are also easy to read, taking some of the strain out of working out how you won during payouts.\nThere’s an electronic soundtrack that draws a little on sitars and drums to add to the atmosphere of the game.\nLike most IGT slots the animation is functional and smooth, but nothing special. It doesn’t blow you away, but it is solid enough that it doesn’t detract from the game.",
        "media": []
      },
      "Cleopatra slot Gameplay": {
        "text": "Gameplay is where Cleopatra rather disappoints.\nIt is a pretty standard five-reel slot with up to twenty winlines. You can select fewer if you want to up you volatility somewhat (the choice is between 1, 5, 9, 15 or 20 lines). Beyond that there is little to change up the play.\nThe bonus round when you hit it is a little too simple (just free spins and a multiplier).\nIf all you want from your slot is money-in, money-out then there are more streamlined games. If you want more fun from your slots, the gameplay lets you down on that score too.",
        "media": [
          {
            "type": "video",
            "url": "https://www.youtube.com/embed/4A2BSiQGZqY",
            "caption": "Video featuring 15 free spins"
          },
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/29678/cleopatra-basic-symbols-paytable.png?imageDataId=27644&timestamp=1653397683000",
            "alt": "Cleopatra Basic Symbols Paytable",
            "caption": "Paytable of the basic winning combinations in Cleopatra slot"
          },
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/29679/cleopatra-top-symbols-paytable.png?imageDataId=27645&timestamp=1653397684000",
            "alt": "Cleopatra Top Symbols Paytable",
            "caption": "Cleopatra's top symbols paytable"
          }
        ]
      },
      "Wilds, Bonuses and Free Spins in Cleopatra slot": {
        "text": "There is a Wild symbol (the Cleopatra Logo) which will help you fill out a winline for any symbol except the scatter.\nThere is a nice rule where if you hit a payout with a Wild symbol then the payout doubles.\nShould you hit two or more Scatter Symbols they will pay a multiple of your total bet (as opposed to the bet per line). But if you hit three or more Scatter symbols, the real payout will be on the 15 free spins you take down.\nDuring the Bonus rounds there all the payouts are tripled (apart from the payout for 5 wilds). Free spins can be retriggered up to 180 total free spins, but on the whole you can expect to play your 15 and cash out.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/29680/cleopatra-bonus-and-scatter-paytable.png?imageDataId=27646&timestamp=1653397684000",
            "alt": "Cleopatra Bonus And Scatter Paytable",
            "caption": "Information on the scatter awards in the Cleopatra slot"
          }
        ]
      },
      "Cleopatra slot Bet Sizes, RTP and Variance": {
        "text": "Cleopatra is a low to medium volatility slot, so although it is a popular classic of the genre, we tend to avoid slots that are not high-volatility (for more on why see our strategy section).\nThe RTP is a little disappointing as well at 95.02% which is a little below the industries average of about 96%.\nThe site we tested allowed a range of bets from $/£/€0.20 to $/£/€200 per spin depending on how many lines and the cash value set to the coins. Which is a reasonable spread.",
        "media": []
      },
      "Conclusion": {
        "text": "Cleopatra is a popular slot that is not going anywhere. Many players will enjoy a few spins for old times’ sake, but on the whole she is showing her age.\nThe design is solid but uninspired and the real letdown is the oversimple gameplay.\nWhen added to the poor RTP and low variance this slot looks like it should be unattractive, but must be doing something right, because people keep coming back to play Cleopatra.",
        "media": []
      }
    }
  },
  {
    "title": "Cats",
    "thumbnail": "https://static.casino.guru/pict/2662/Cats.png?timestamp=1653468482000&imageDataId=264359&width=320&height=247",
    "rating": 6.17,
    "images": [],
    "overview": "Cats\n    \n        Play Cats demo slot online for fun. Enjoy free casino games in demo mode on Casino Guru. Expert review included.",
    "about_game": "Players will likely get the African safari experience when they first enter the slot’s 5x3 grid and benefit from max 30 active paylines. The Cats sound effects help this purpose, but it’s the bonus features that attract players to this title with a 94.93% RTP.",
    "game_informations": {
      "game_developer": "IGT",
      "progressive_jackpot": false,
      "configurable_winlines": true,
      "bonus_feature": false,
      "free_spins": true,
      "autoplay": false,
      "quickspin_feature": false,
      "gamble_feature": false,
      "number_of_winlines": "30",
      "layout": "3-3-3-3-3",
      "min_bet": "$30",
      "max_bet": "$15,000",
      "release_date": "August 2013",
      "last_update": "02 May 2024"
    },
    "game_provider": {
      "title": "IGT",
      "slug": "igt"
    },
    "game_stats": {
      "return_to_player": "94.93%",
      "game_type": "Slots",
      "payout_system": "Winlines"
    },
    "game_tags": [
      {
        "title": "Animals",
        "slug": "animals"
      },
      {
        "title": "5-Reels",
        "slug": "5-reels"
      }
    ],
    "game_src": "https://casinoguru-en.com/embedGame?identifier=74291e1f-98a7-4b32-8895-144ebf2c6731",
    "game_review": {
      "Theme and Storyline": {
        "text": "To clarify, the Cats slot by IGT actually deals with wild cats instead of domestic pets, and will likely transcend players to the sun-washed African savannahs through the reel backdrop.\nWhile there is no in-depth storyline to boost the immersive experience, the overall combination of elements manages to set the right tone for any cats lover.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/805578/cats-slot-base-game-win.png?imageDataId=850760&timestamp=1714637423000",
            "alt": "Cats slot base game win",
            "caption": "Win in the Cats slot"
          }
        ]
      },
      "Graphics, Sounds and Animations": {
        "text": "Considering it is an extension to IGT’s land-based slot product, and one released some time ago, the graphics and animation effects are bound to seem a bit outdated in the ever-developing tech software industry.\nThe sound effects offer a surprising twist, as most regular slot players would expect the typical drum-like beat of the African wilderness, whilst they are welcomed by the roar of wildcats.",
        "media": []
      },
      "Gameplay": {
        "text": "The basic gameplay elements directly reflect the theme of the slot, with the 5x3 reel grid set against a sunset-like backdrop, and the symbols bearing the animated likeness of all kinds of felines. Namely, the lowest value symbols on the grid make use of the standard J, Q, K and A cards, while those offering higher payouts include lions, tigers, black panthers, mountain lions and cheetahs.\nAside from the regular symbols on the Cats slot reels, there are those triggering the gameplay’s special features – the cat paw Scatter and the Cats logo as Wild. The latter is particularly crucial to the slot’s overall action, as it offers players the chance to hit the fixed jackpot of 10,000 coins when 5 Cats Wilds appear on the reels.",
        "media": [
          {
            "type": "video",
            "url": "https://www.youtube.com/embed/CgpMRpvMm4Y",
            "caption": "Gameplay video"
          }
        ]
      },
      "Bonus features": {
        "text": "As it was just mentioned, there are significant amounts to be won at this slot’s reel grid when taking into account the bonus features. Split symbolsis one such bonus feature – when the animals or paws on the slot’s symbols come in pairs, the single symbol tile stands for two of the same kind. Split symbols can land on all 5 reels, offering their payout for 10 on an active payline.\nThe Free Spins bonus round is yet another feature – it is triggered by the cat’s paw Scatter symbol which can land on the middle reels 2, 3 and 4. A minimum of 5 is required to trigger a round of 5 Free Spins, while 6 Paws, i.e. 3 split symbols will reward players with 10 Free Spins. Even if only 4 Paws appear per spin, players can benefit fromis multiplier – 2x the total bet.",
        "media": []
      },
      "Bet size and payouts": {
        "text": "Players can choose to bet from as little as €0.01 for 1 line 1 coin bet up to €30 as a max bet amount, with the ability to benefit from maximum 30 adjustable paylines. As for wins, the cards have the lowest payouts while the wildcats give players the chance to win 1000x their bet amount, with the exception of the black panther which pays 2500x the bet amount for 10 (5 split symbols) on an active payline.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/803932/cats-slot-high-symbols-paytable.png?imageDataId=848932&timestamp=1714476865000",
            "alt": "Cats slot - High paying symbols",
            "caption": "Base game paytable for the Cats slot machine"
          }
        ]
      },
      "RTP and Variance": {
        "text": "The slot’s RTP has been calculated at 94.93%, with a low to mid variance estimate. This allows players to argue this slot title as below industry average, considering the range of gameplay and RTP percentages available on more recent releases.",
        "media": []
      },
      "Conclusion": {
        "text": "All in all, the Cats slot release by IGT manages to meet players’ basic needs and beyond, while its attractive bonus features and jackpot opportunity make it an appealing online gambling destination. It may need some fine-tuning of the design or sound aspects, but its rewarding potential is definitely its redeeming quality.",
        "media": []
      }
    }
  },
  {
    "title": "Wheel of Fortune Triple Extreme Spin",
    "thumbnail": "https://static.casino.guru/pict/2664/Wheel-of-Fortune-Triple-Extreme-Spin.png?timestamp=1653471186000&imageDataId=270967&width=320&height=247",
    "rating": null,
    "images": [],
    "overview": "Wheel of Fortune Triple Extreme Spin\n    \n        Play Wheel of Fortune Triple Extreme Spin demo slot online for fun. Enjoy free casino games in demo mode on Casino Guru. No download required.",
    "about_game": "Wheel of Fortune Triple Extreme Spin is a slot machine by IGT. According to the number of players searching for it, Wheel of Fortune Triple Extreme Spin is not a very popular slot. Still, that doesn't necessarily mean that it's bad, so give it a try and see for yourself, or browse popular casino games.To play for free in demo mode, just load the game and press the 'Spin' button. You can learn more about slot machines and how they work in our online slots guide.",
    "game_informations": {
      "game_developer": "IGT",
      "progressive_jackpot": false,
      "configurable_winlines": false,
      "bonus_feature": true,
      "free_spins": false,
      "autoplay": true,
      "quickspin_feature": false,
      "gamble_feature": false,
      "number_of_winlines": "720",
      "min_bet": "$50",
      "max_bet": "$25,000",
      "release_date": "September 2015"
    },
    "game_provider": {
      "title": "IGT",
      "slug": "igt"
    },
    "game_stats": {
      "return_to_player": "96.08%",
      "game_type": "Slots",
      "payout_system": "Winlines"
    },
    "game_tags": [
      {
        "title": "Fruits",
        "slug": "fruits"
      },
      {
        "title": "Gems and diamonds",
        "slug": "gems-and-diamonds"
      },
      {
        "title": "5-Reels",
        "slug": "5-reels"
      },
      {
        "title": "Money and wealth",
        "slug": "money-and-wealth"
      }
    ],
    "game_src": "https://casinoguru-en.com/embedGame?identifier=482959d7-b491-4fd7-b526-28051439923c",
    "game_review": null
  },
  {
    "title": "Siberian Storm",
    "thumbnail": "https://static.casino.guru/pict/2666/Siberian-Storm.png?timestamp=1653471126000&imageDataId=270915&width=320&height=247",
    "rating": 6.83,
    "images": [],
    "overview": "Siberian Storm\n    \n        Play Siberian Storm demo slot online for fun. Enjoy free casino games in demo mode on Casino Guru. Expert review included.",
    "about_game": "Siberian Storm is a snowy, tiger themed game with an odd look. Unfortunately the cosmetic format changes don’t save an otherwise very average slot: average design, average RTP, slightly-higher than average variance.",
    "game_informations": {
      "game_developer": "IGT",
      "progressive_jackpot": false,
      "configurable_winlines": false,
      "bonus_feature": false,
      "free_spins": true,
      "autoplay": true,
      "quickspin_feature": false,
      "gamble_feature": false,
      "number_of_winlines": "720",
      "layout": "5-5-5-5-5",
      "min_bet": "$1",
      "max_bet": "$1,000",
      "release_date": "October 2011",
      "last_update": "02 May 2024"
    },
    "game_provider": {
      "title": "IGT",
      "slug": "igt"
    },
    "game_stats": {
      "return_to_player": "96%",
      "game_type": "Slots",
      "payout_system": "Winlines"
    },
    "game_tags": [
      {
        "title": "Animals",
        "slug": "animals"
      },
      {
        "title": "Gems and diamonds",
        "slug": "gems-and-diamonds"
      },
      {
        "title": "5-Reels",
        "slug": "5-reels"
      }
    ],
    "game_src": "https://casinoguru-en.com/embedGame?identifier=5070feda-b0bf-4ca8-8286-aae46789f7b0",
    "game_review": {
      "Theme and Story Line": {
        "text": "The Siberian tiger is a majestic beast and this game cashes in on that in a big way. The snowy backdrop and big cat symbols make for a wild and windy theme.\nThis is coupled with more generic jewelry symbols which are given thematic character by their Russian designs.\nWill you brave the snow to claim your prize?",
        "media": []
      },
      "Graphics, Sounds and Animations": {
        "text": "The game is pleasant enough to look at. The images are exotic and well painted even if something a little simpler and cartoony might have been easier to read on a slot reel.\nThe music is a very strange choice however and does not go with the theme at all. At least it only plays during the actual spins.\nThe animations are simple but functional.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/35527/siberian-storm-5-reel-slot.png?imageDataId=27769&timestamp=1653397810000",
            "alt": "Siberian Storm 5 Reel Slot",
            "caption": "Siberian Storm doesn't use standard arrangement of the reels"
          }
        ]
      },
      "Siberian Storm slot Gameplay": {
        "text": "Despite the somewhat busy looking layout the central gameplay of Siberian Storm is very simple. You win for symbols on consecutive reels starting from either the leftmost or rightmost reel.\nThis coupled with the 3-4-5-4-3 arrangement on the reels, makes for 720 ways to win. This format does make for some exciting spins as there is a lot to be paying attention to.",
        "media": [
          {
            "type": "video",
            "url": "https://www.youtube.com/embed/qIz9Yr8LxtQ",
            "caption": "Gameplay video featuring free spins bonus"
          }
        ]
      },
      "Wilds, Bonuses and Free Spins in Siberian Storm slot": {
        "text": "There are three special symbols in Siberian Storm. Scatter symbols play much as they do in other games. Hit three or more on any combination of reels and you receive a payout.\nIn addition to this there are separate Wild symbols. These are less useful than in most games since the fourth and fifth rows are only three symbols deep each, there are fewer options for matching the wild than in other games that eschew winlines in favour of consecutive reel payouts.\nThe third and final special symbol is the Bonus symbol represented by the eye of a tiger (cue music...). This Bonus is especially hard to trigger as you must hit a symbol on five consecutive reels.\nIf you do though, you get 8 free spins. These reels contain twice as many stacked bonus symbols increasing your chance of hit respins (up to 240 free spins total per bonus round).",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/35528/siberian-storm-free-spins-explanation.png?imageDataId=27770&timestamp=1653397810000",
            "alt": "Siberian Storm Free Spins Explanation",
            "caption": "Explanation of how the free spin feature works in Siberian Storm"
          }
        ]
      },
      "Siberian Storm slot Bet Sizes, RTP and Variance": {
        "text": "The game has a respectable RTP of 96.00%, which is more or less the average for these sorts of games.\nYou can expect medium to high variance, so you should factor that into your bet sizing which, due to the 720-ways payout structure is relatively inflexible. You bet 50 coins for each spin. As a result bet sizes are limited by the range of coin values any given site allows.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/35529/siberian-storm-paytable.png?imageDataId=27771&timestamp=1653397811000",
            "alt": "Siberian Storm Paytable",
            "caption": "Complete paytable of the Siberian Storm slot"
          }
        ]
      },
      "Conclusion": {
        "text": "Siberian Storm is, visually interesting with its 3-4-5-4-3 format, and its 720-ways is a small twist on a common distribution of winlines.\nHowever, these minor innovation don’t add very much to a gaming experience that is otherwise very basic. The average RTP and med-high variance don’t single the game out enough to make up for this fact.\nOverall it ends up being a disappointment.",
        "media": []
      }
    }
  },
  {
    "title": "Golden Goddess",
    "thumbnail": "https://static.casino.guru/pict/2668/Golden-Goddess.png?timestamp=1653468540000&imageDataId=264398&width=320&height=247",
    "rating": 7.79,
    "images": [],
    "overview": "Golden Goddess\n    \n        Play Golden Goddess demo slot online for fun. Enjoy free casino games in demo mode on Casino Guru. Expert review included.",
    "about_game": "Golden Goddess is a video slot coming from IGT. The game reels are set on a mountain top where players can land big payouts thanks to the Super Stacks symbols. This is a fun slot to play with an attractive set of bonus features and an interesting gameplay.",
    "game_informations": {
      "game_developer": "IGT",
      "progressive_jackpot": false,
      "configurable_winlines": false,
      "bonus_feature": false,
      "free_spins": true,
      "autoplay": true,
      "quickspin_feature": false,
      "gamble_feature": false,
      "number_of_winlines": "40",
      "layout": "3-3-3-3-3",
      "min_bet": "$40",
      "max_bet": "$120,000",
      "release_date": "September 2013",
      "last_update": "02 May 2024"
    },
    "game_provider": {
      "title": "IGT",
      "slug": "igt"
    },
    "game_stats": {
      "return_to_player": "96%",
      "game_type": "Slots",
      "payout_system": "Winlines"
    },
    "game_tags": [
      {
        "title": "Medieval",
        "slug": "medieval"
      },
      {
        "title": "5-Reels",
        "slug": "5-reels"
      },
      {
        "title": "Fairy tales",
        "slug": "fairy-tales"
      }
    ],
    "game_src": "https://casinoguru-en.com/embedGame?identifier=38e4bfb8-15e4-4711-aae9-e99f47fea4a7",
    "game_review": {
      "Theme and Visual Details": {
        "text": "The game theme in Golden Goddess comes from Greek mythology. The Goddess symbol in the game resembles Athena and the Horse symbol is most probably inspired by Pegasus.\nThe visual details in the slot are on a decent level, despite the lack of modern animations. Overall Golden Goddess is a visually attractive slot which will certainly catch your attention.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/39077/golden-goddess-paytable.png?imageDataId=27700&timestamp=1653397745000",
            "alt": "Paytable",
            "caption": "Base game paytable"
          },
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/39076/golden-goddess-bonus-paytable.png?imageDataId=27716&timestamp=1653397749000",
            "alt": "Free Spins Paytable",
            "caption": "Paytable in free spins mode is almost the same as in the base game"
          }
        ]
      },
      "Gameplay": {
        "text": "The gameplay in the slot is pretty fast and exciting. All of the symbols can land stacked across the reels so you can easily land a full screen of matching symbols in a single spin. This guarantees a big payout thanks to the big number of pay lines and the rich paytable.",
        "media": [
          {
            "type": "video",
            "url": "https://www.youtube.com/embed/5vviM0Wo85A",
            "caption": "Gameplay video featuring 7 free spins"
          }
        ]
      },
      "Bet size and payouts": {
        "text": "Golden Goddess is a 40 payline slot with 5 reels and 3 rows. Players can bet anywhere from $0.40 to $20 per spin.\nThe biggest payouts in the slot come from the Golden Goddess Logo symbol. Landing 5 of them on a winning pay line will reward you with a 1,000-coin payout. If you manage to land a full screen of these symbols you will walk away with a 40,000-coin payout.\nThe RTP value in the game is 96% and the slot comes with a medium to high variance.",
        "media": [
          {
            "type": "image",
            "url": "https://static.casino.guru/pict/39077/golden-goddess-paytable.png?imageDataId=27700&timestamp=1653397745000",
            "alt": "Paytable",
            "caption": "Base game paytable"
          }
        ]
      },
      "Bonus features": {
        "text": "The Golden Goddess Logo symbol is the Wild symbol in the game. It can land stacked on every reel and will replace all symbols in the game except for the Rose symbol.\nThe Rose is the Bonus symbol in the game and it can land on reels 2, 3 and 4 only. It can land stacked on the reels and once it covers the three central reels the free spins bonus is triggered.\nThe player is awarded with 7 free spins which can be re-triggered during the feature. Before the free spins start the player will need to pick one of the Rose symbols.\nThis symbol will reveal either the Goddess, Prince, Horse or Dove symbol. The chosen symbol will act as a Super Stacked symbol during the feature and all stacks of symbols will transform to the chosen symbol.",
        "media": []
      },
      "Conclusion": {
        "text": "Golden Goddess is an interesting slot coming from the big IGT portfolio which is sure to catch your attention. The visual details in the game are decent and the designers used a popular Greek mythology theme.\nThe stacked symbols during base play and the Super Stacks during the feature can easily award a full screen of identical symbols and a big payout.",
        "media": []
      }
    }
  }
]