[
  {
    "title": "Nolimit City",
    "logo": "https://static.casino.guru/pict/124056/NoLimit_dark-1.svg?timestamp=1733241096000&imageDataId=1087148",
    "provider_info": {
      "About Nolimit Games": {
        "text": "Nolimit City is a Stockholm-based iGaming developer that was formed in 2014. It specializes in producing online casino games and software, which it distributes among many casino operators, many of which you can view on our list of Nolimit City casinos.\nSince its inception, Nolimit City's story has been one based on quick growth. Within their first year, they released their first hit, Creepy Carnival, which was a success in the early mobile casino market with its HTML-5 capabilities.\nFollowing that, it built up an impressive list of key partners, releasing new Nolimit City slots at the same time, including Ice Ice Yeti and Dungeon Quest.\nAs well as their mobile play, Nolimit games developed a reputation for being fun and engaging, with a range of styles that included something for everyone.\nBy 2021, the company had extended its presence to several countries, including Italy, Denmark, and Portugal, and had also acquired supplier licenses for markets in Romania and Ontario.\nTheir progress was enough to convince Evolution AB to make a bid of EUR 340 million to take them over in 2022, a deal that was swiftly completed that same year.",
        "note": ""
      },
      "Nolimit City slots to look out for": {
        "text": "Nolimit games have a reputation for being bright and innovative, with entertaining themes and some interesting bonus features.\nNolimit slot games are the company's specialty, and several of their most popular releases have strong themes based on horror and action.",
        "note": ""
      },
      "Book of Shadows and Tombstone R.I.P.": {
        "text": "Two examples of horror-themed games on this page are Book of Shadows and Tombstone R.I.P., both slots have received very positive reviews from our team of experts.\nBoth use a haunting soundtrack to add atmosphere to the gameplay, and offer the players a variety of bonus features that they can reach should they get lucky and land one of the winning spin combinations.",
        "note": ""
      },
      "Bonus Bunnies, Gaelic Gold, and Owls": {
        "text": "If it's a softer approach you're after, then you'll also find a range of cuter animated games that focus on making you smile as you play.\nBonus Bunnies, Gaelic Gold, and a game simply titled Owls all offer light-hearted slots reels, with jovial characters ranging from leprechauns to, well, bunnies and owls. Don't let the cuteness fool you, though: these games all have exciting gameplay elements that make them a popular choice for players.\nOne last thing to look out for in Nolimit City slots is an in-house tool called xFeatures. These include xWays, which increases ways to win by splitting symbols, and xNudge, a wild feature that comes with a multiplier.\nExamples of these games are Hot Nudge, which has the xNudge option (of course), and Punk Rocker, a cool punk-inspired five-reeler that lets you put the xWays feature to the test.",
        "note": ""
      }
    }
  },
  {
    "title": "NetEnt",
    "logo": "https://static.casino.guru/pict/123435/NetEnt_white.svg?timestamp=1662360356000&imageDataId=368971",
    "provider_info": {
      "Information about NetEnt games": {
        "text": "When it comes to online slots games, Swedish enterprise NetEnt is one of the first names to spring to mind for many people. Their history is closely entwined with the rise of the iGaming industry, after they were founded during the early years of widespread internet use in 1996.\nFollowing their first online casino partnership in 2000, the company expanded its stock of games and struck up partnerships with key providers. With their Malta and Alderney gaming licenses, they moved into the mobile gaming market, producing their first entirely HTML5 slot in 2014, and also became an associated member of the World Lottery Association.\nNow a member of the Swedish Stock Exchange, NetEnt serves over 200 customers and has over 1,000 employees in several offices around the world. Their acquisition of Red Tiger Gaming for £200 million in 2019 allowed them to diversify their content, and there were 31 new NetEnt titles in that year alone.\nTheir status as a leading light on the iGaming scene saw them subject to a huge $2.12 billion bid from Evolution Gaming, known for their live-dealer casino games, in June 2020 and could be the start of a dominant partnership for decades to come.",
        "note": ""
      },
      "NetEnt slots and casino games": {
        "text": "NetEnt's diverse library of slot games seek to thrill many different types of player. With this in mind, it's perhaps best to view them in four different categories:",
        "note": ""
      },
      "Classic slots from NetEnt": {
        "text": "Their simple interface and traditional symbols may not be innovative, but NetEnt knows that classic slots still hold a place in the hearts of many online casino players.\nThey're also a good way to learn about slots: after all, they won't distract you with cutting-edge graphics and special effects.\nA good example of the NetEnt classic slot is Grand Spinn. An easy-to-play single line slot, it's a nice introduction to the iGaming world. The RTP is generous and it also has some nice features like Multiplier Wilds, which can multiply your win several times.",
        "note": ""
      },
      "Video slots from NetEnt": {
        "text": "For more detailed graphics, then NetEnt video slots are a great option. More elaborate than their classic cousins, they'll typically feature five reels and at least nine paylines.\nGonzo's Quest is a fine example of this. NetEnt refer to it as their 'first platinum video slot game' and it's easy to see how its gorgeous animations draw players in. Players can get up to a 2,500x win per line, as well as a special free spins feature called Free Falls.\nDead or Alive II is a more recent title: boasting superb graphics, its high variance nature means you can win up to 40,500x your stake in its High Noon feature.",
        "note": ""
      },
      "Progressive slots from NetEnt": {
        "text": "NetEnt's progressive slots tempt players with their lucrative jackpots that can pay out millions. Mega Fortune, for example, paid out €17.8 million to a lucky gambler in 2013, smashing the world record payout and earning a place in the Guinness Book of Records.\nOther progressive titles include Mercy of the Gods, which boasts a high RTP and a massive win potential, and Arabian Nights whose progressive jackpot can get extremely large indeed.",
        "note": ""
      },
      "Other types of casino games": {
        "text": "Despite all these titles, the provider is not just known for its slots. There are other types of NetEnt casino games in its selection, the predominant ones being various kinds of table games. This means you can play NetEnt variants of games like roulette, blackjack, baccarat, and Texas Hold'Em poker. The roulette titles include 'live' versions which are designed to give you an immersive casino experience as the game is operated by a live dealer.",
        "note": ""
      }
    }
  },
  {
    "title": "Novomatic",
    "logo": "https://static.casino.guru/pict/124058/Novomatic_white.svg?timestamp=1662360383000&imageDataId=368975",
    "provider_info": {
      "Information about Novomatic casinos": {
        "text": "Novomatic is part of the one of the biggest gaming technology companies on the planet, Novomatic Group, which turns over billions of euros a year.\nThe company's knowledge of the casino games is deep, stretching back to its roots in the land-based casino industry from 1980, and it has introduced innovative technology and equipment along the way, most notable the iconic American Poker II game and the Micro Processor 01 unit.\nSuch success laid the groundwork for a move into the digital sphere. The Coolfire Coldfire Risc Processor provided the hardware platform in interactive live gaming, and helped the Group break the $1 billion annual turnover mark in 2005. The company then moved into several new markets in Asia, South America and Europe.\nIn 2008, the acquisition of Greentube Group helped Novomatic break into the online sector and it continued to acquire a series of companies to boost their growth.\nToday Novomatic Group has a presence in over 50 countries, employing over 30,000 people. Its casino games arm has a diverse mix of online slots games and electronic table games, some of which we'll take a look at in the next section.",
        "note": ""
      },
      "Novomatic slot machines and casino games": {
        "text": "Novomatic online slots all share one great feature in common – a classic feel with traditional designs their preferred style; these are games that can also be played in land-based casinos and, as such, they attract fans of these who want to try them out online. They have a variety of tempting jackpots that can run into the hundreds of thousands of dollars.\nDolphin's Pearl is one of its oldest titles and it stays true to Novomatic's bright style. A five-reeler set deep in the ocean, it has a serene quality about it, and some gorgeous symbols of marine animals. Its generous bonus feature 'Free Spins extra' has helped make the game so popular that a Deluxe edition was released later on.\nBook of Ra has a very different theme, but still tempts players with beautiful visuals of Ancient Egypt. It also has a modern Deluxe version which includes an exciting extra that gives the player a chance to double their winnings. But perhaps the biggest reason for the game's popularity is its great free spins feature. Here, accompanied by dramatic music, a winning symbol is selected to fill in the reels it lands on during the free spins but, unlike other slots of the time, the winnings don't have to go from left to right on the grid when this happens. This was an innovative concept that inspired others to follow its lead and resulted in a plethora of \"Book of …\" titles from a number of providers.\nNovomatic also has a range of more classic-looking titles, with Sizzling Hot Deluxe being among the favourites. It offers the classic fruit symbols of gambling machines of yesteryear and will appeal to the traditional player. A downside is that there are no bonus features in this title, which may put off some people who are used to them in modern slots games.\nSpeaking of traditional games, Novomatic also offers a number of classic and table games, including roulette, blackjack and electronic poker. All of these offer different styles within the game; so with the poker title, for example, you can switch between 3-card and Caribbean poker as you play.",
        "note": ""
      }
    }
  },
  {
    "title": "Playtech",
    "logo": "https://static.casino.guru/pict/124084/Playtech_white.svg?timestamp=1662360406000&imageDataId=368979",
    "provider_info": {
      "Information about Playtech games": {
        "text": "As the largest online gaming software supplier on the planet, Playtech has come a long way since its inception in Estonia back in 1999. The man behind the enterprise, entrepreneur Teddy Sagi, had the goal of supplying next-generation casino technology and content to the global market, but it took Playtech two years to get its first casino customer.\nRiding the crest of the internet wave, it launched its iPoker network in 2004, which would eventually become the biggest in the world, and it started trading on the London Stock Exchange soon after.\nThrough a series of smart acquisitions and partnerships, Playtech's success truly took off and the quality of its casino products proved to be among the very best on the market. In terms of online casino games, partnerships with the likes of Paramount and Warner Brothers ensured a steady output of high-class content.\nToday, Playtech stands as a dominant player in the iGaming industry, with a workforce of several thousand people and an office presence in countries as diverse as Gibraltar and Israel. They also hold a number of licenses, which backs up their authenticity as a provider and should give players peace of mind when trying out their games.",
        "note": ""
      },
      "Playtech slots and casino games": {
        "text": "Playtech has a reputation for developing online casino games at a prolific rate, adding around 50 games a year to an already huge list of hundreds of titles.\nStarting off with 2D slots games, many Playtech titles offer basic graphics but great gameplay. 8 Ball Slots is an example of a modern game paying homage to the classic style, with its simple three reels of billiard balls giving the player a retro experience.\nMore recent titles are developed in 3D and include some superb video-based games. A great example of this is its Batman vs Superman title, part of its DC Games series, which presents stunning cinematic graphics based on the 2016 movie. Like with all DC offerings, players can get some great bonus features and also a Super Heroes sequence where you get the chance to win one of four progressive jackpots.\nPlaytech also caters for fans of TV shows, and The Flintstones is an entertaining title to try out. With cartoony graphics, you can play the fun five-reeler on all devices, and also try out a great bowling bonus feature, where your prize multiplies by the number of pins you knock down. American Dad and Baywatch are some other entertaining games based on programmes from the small screen.\nIf you're looking for progressive jackpots, then titles such as Mega Ball and Gold Rally will satisfy your thirst. Gold Rally, for example, offers eight paylines and a chance to win a life-changing jackpot amount should you fill your screen with nine scatter symbols. Beach Life is another title that paid out several million Euros in 2012.\nWe shouldn't overlook Playtech's selection of table games and other types of casino games, with many blackjack, roulette and video poker titles for players to choose from. These games are known for their smooth gameplay, futuristic graphics and fantastic audio.",
        "note": ""
      }
    }
  },
  {
    "title": "Apricot (Microgaming)",
    "logo": "https://static.casino.guru/pict/124047/18pro.svg?timestamp=1727772233000&imageDataId=1022155",
    "provider_info": {
      "Information about Microgaming games": {
        "text": "Did you know that Microgaming developed the world's first ever online casino software? This was back in 1994, when the company — and the internet — was in its infancy, and since then the company has also become well-known for its pioneering mobile casino platform.\nThe firsts don't stop there. Microgaming released the first-ever licensed branded slot game with Tomb Raider in 2004, and this triggered a series of emphatic blockbuster titles which the company has become famous for. Jurassic World, Game of Thrones, even Playboy, are the household names that you can find within their selection.\nBased on the scenic Isle of Man, Microgaming produce their software and games according to licenses which they hold with the Malta Gaming Authority and the UK Gambling Commission. They are even founding members of eCOGRA (e-Commerce Online Gaming Regulation and Assurance), a body dedicated to fair and responsible gaming, so all their products carry a seal of authenticity.\nThe company counts several independent gaming studios among their partners and their collaboration with these allows them to improve and expand their range of online slots games.",
        "note": ""
      },
      "Microgaming Games": {
        "text": "If the previous firsts weren't enough before, then how about a world record? Microgaming's Mega Moolah holds the title of 'Biggest Online Slots Payout Ever' with its €17.8 million pay-out in 2015, earning it a place in the Guinness Book of World Records.\nWith that, a good place to begin a look at Microgaming's slots is with Mega Moolah itself. This five-reel, 25-payline title holds its four in-house progressive jackpots as its main attraction — they make those huge pay-outs possible after all — but, even without them, the game has great free spins, entertaining characters and nice graphics.\nImmortal Romance is a Microgaming title that offers a slightly different take. Combining an intriguing vampire storyline with exciting graphics, the game offers generous bonus rounds including four different spin features and in-game wilds.\nAs mentioned, their themed slots are a popular choice and Jurassic Park provides plenty of thrills with its crisp-looking dinosaur reels. Players hope to get a five-reel combo as they spin and the T-Rex version pays out the most, incorporating a fun 'wilds' feature.\nMicrogaming have also revamped successful titles to cater for a more modern market. Thunderstruck II is a great example of this, taking their 2003 hit and adding HD gaming options, such as new features and rewards. The centerpiece of these is a 'Great Hall of Spins' feature which the player can access from getting three hammers from the God Thor. It works by giving you four bonus options to choose from, each with a different number of spins and features.\nApart from their slot games, Microgaming also produces traditional casino games such as roulette and video poker. Fans of these can expect to enjoy smooth gameplay and solid graphics as they compete for high stakes.",
        "note": ""
      }
    }
  },
  {
    "title": "TaDa Gaming",
    "logo": "https://static.casino.guru/pict/426036/TaDa_white.svg?timestamp=1723538573000&imageDataId=977807",
    "provider_info": {
      "Information about TaDa Gaming": {
        "text": "TaDa Gaming is a newer game developer based in Malta. The company was established in 2019 as a subsidiary of the Taiwanese giant International Games Systems Ltd. This means that, even though TaDa may be quite fresh and unknown in the European market, it is based on more than 30 years of experience in the gaming scene.\nWith the slogan \"Feel the Magic,\" TaDa Gaming is all about delivering a magical experience to players worldwide. So far, the developer boasts a portfolio of more than 100 game titles within categories such as slots, crash games, bingo, and table games.\nThe game developer is committed to upholding the highest standards of quality and security. Players can feel safe when checking out TaDa slots and other games, thanks to a valid license from the Malta Gaming Authority (MGA) and certifications by the industry leaders BMM Test Labs and Gaming Labs International.",
        "note": "At the heart of TaDa Gaming's mission is a commitment to excellence and innovation. Their focus on mobile-first experiences ensures that no matter where you are, you can enjoy their games seamlessly across all devices."
      },
      "Themes and features of TaDa slots and casino games": {
        "text": "With more than 100 HTML5 games released, there are a lot of TaDa Gaming titles to explore. A majority of them are virtual slots and jackpot games. TaDa slots and games come with many different themes and features. We are going to explore some that are worth checking out.",
        "note": ""
      },
      "Fish and hunt for wins": {
        "text": "Whether you're hunting for treasure or embarking on mythical quests, TaDa brings a sense of adventure and wonder to every game. One of the provider's main game categories is \"Fish and Arcade\", where you can explore vibrant underwater and exotic worlds.\nSome of the top games in this category include Mega Fishing, where players dive deep into the ocean to catch exotic fish and unlock big wins. The game comes with a choice between three different \"rooms\" based on your preferred betting level.\nJackpot Fishing has a similar setup but adds a competitive edge with multiple players battling for a progressive jackpot.\nIf fish is not your forte, Jogo do Bicho mixes exotic gameplay with a lottery-style system inspired by the popular Brazilian animal game with the same name, providing a fresh twist on the genre.",
        "note": ""
      },
      "Triple the fun with TriLuck™": {
        "text": "The TriLuck™ series is a signature creation by TaDa Gaming. The games in the series feature three interactive mechanics that combine to deliver accumulative wins, with the chance to unlock all three in a single spin for maximum wins.\nA prime example of this TaDa uniqueness is the slot 3 Lucky Piggy. In this slot, players can unlock free spins and land one of three progressive jackpots. During free spins, super stack symbols accumulate and persist. As in all TriLuck™ games, players have the chance to unlock all three features separately or at once.",
        "note": "To test the magic of TaDa slots yourself, you can try the TaDa Gaming demo games available on this page. Play instantly without the need for any download, registration, or deposit."
      }
    }
  },
  {
    "title": "Play'n GO",
    "logo": "https://static.casino.guru/pict/124074/PlayNGo_white.svg?timestamp=1662360394000&imageDataId=368977",
    "provider_info": {
      "Information about Play'n GO games": {
        "text": "Starting out as a group of self-confessed computer geeks, Play'n GO decided to team their talents together in 1997 to offer companies reliable casino software solutions.\nThey had great timing. This was at the start of the growing online casino industry and Play'n GO was well-placed to take advantage of it. Over the next two decades, they expanded impressively, becoming the first online casino games developer to create mobile titles along the way – something very common at the time of mobile casinos, but definitely not back then.\nPlay'n GO provides an excellent range of casino games, including slots titles, table games, and even video bingo. Their slots stand out, and the company's efforts in this area earned them 'Slot Provider of the Year' at the prestigious International Gaming Awards in 2020.\nBacked up by top licenses from the likes of the Malta Gaming Authority and the UK Gambling Commission, to name just a couple, you can be sure that Play'n GO games are safe and reliable. The company continues to add to their collection several times a year, so there's never a shortage of titles to try out.\nWith an established presence in Latin American and European markets, Play'n GO is a provider to watch in the online casino industry, and it's why many casino sites are keen to include Play'n Go games in their selection.",
        "note": ""
      },
      "Play'n GO slots and casino games": {
        "text": "When it comes to Play'n GO games, slots are definitely their most played titles. Their modern, shiny graphics and exciting gameplay make them an attractive choice for gamers with over 100 titles to choose from.\nThe Book of Dead is one such entertaining game. Based on an Ancient Egyptian theme, its five reels feature symbols of pharaohs, scarab beetles and ancient scrolls. The game boasts slick graphics and animations, with an exciting bonus feature modelled on Novomatic's famous Book of Ra slot game.\nStaying on the Egyptian theme, but with a slightly left-field twist, Leprechaun Goes Egypt throws one of Ireland's lucky charms into a desert setting to try to win big prizes. Here we have shamrocks and Celtic symbols to go with the Egyptian imagery, and while the free spins feature is very attractive, the multipliers on the game stand out as the top attraction.\nFor a more cosmic offering, Reactoonz plays on a 7x7 grid that is based around a giant alien called Gargantoon. This beast specializes in handing out big prizes, but first you have to get through other features to get the chance to see him in action.\nPlay'n GO also make use of famous names for some slot titles. Nyjah Hudson, the world champion skateboarder, is one such celebrity. His slot offers action sequences of him performing tricks if players hit the special feature 'Wildboard' or form the word 'SKATE' from the game's symbols.\nFor all of Play'n GO's slots success, titles such as Caribbean Stud Poker offer a great non-slots experience. Here you can pit your wits against the dealer in a classic poker table setting. Other examples of table games in this range include European Roulette Pro and Super Wheel.",
        "note": ""
      }
    }
  },
  {
    "title": "Merkur Gaming",
    "logo": "https://static.casino.guru/pict/124043/Merkur_White.svg?timestamp=1662360294000&imageDataId=368967",
    "provider_info": {
      "Information about Merkur games": {
        "text": "Merkur Gaming has been producing casino games and software for online and land-based enterprises since 2005, when it launched its first products as part of the Gauselmann Group.\nGauselmann's experience in the bricks-and-mortar casino industry helped Merkur become a success in this field, and the traditional feel of its online games reflects this influence. Many of its titles contain the classic fruit symbols and arcade-style gameplay that characterize old-fashioned slots. Merkur games are fun, easy to play and backed up with top ISO certification.\nIn recent years, Merkur has expanded to other countries outside of its German base and now boasts a sizeable network of online and land-based casinos. It has offices dotted around the world, including countries like Colombia and South Africa, and can point to an annual turnover of billions of US dollars.\nWith such a strong presence and a wide array of games, it's highly likely that you'll find a Merkur game that you love, and our list of Merkur casinos will guide you to the best sites to play them on for real money. What's more, Merkur regularly releases new titles, so keep an eye on this page for new additions in the future.",
        "note": ""
      },
      "Merkur slots and casino games": {
        "text": "Slots are the order of the day when it comes to Merkur games, but don't be surprised to find a gem of a casino game in the collection, too. Vegas Blackjack, for example, is a fun version of the classic table game and Merkur do a good job of making you feel like you're at the dealer's table.\nWhen it comes to their range of classic fruit-filled slots, then 77777 is a superb choice for those wanting a taste of the traditional. All the fruit symbols are there, sparkling on the screen, and once you start spinning for winning combinations you stand the chance of getting the Wilds symbol which leads to big prizes.\nAway from the classic style, Merkur also has a number of sports-themed titles that catch the eye. Gold Cup is one such game, a five-reeler with reels cleverly designed as foosball table. The symbols represent various world football strips, so fans from most countries will be satisfied, and nice animations, such as a footballer scoring a penalty, spring up should you spin a winning combination. There aren't many bonus features to speak of, but the wild symbol is modelled as a football trophy, which will appeal to fans of 'the beautiful game'.\nNon-sports fans are catered for, too, of course. Queens Citadel is an intriguing slot that combines sharp graphics and animations with some interesting bonuses to keep you entertained. The game is set up with three reels and five paylines, and you spin symbols in the multicolored form of the Queen's jewels. The Queen's own symbol is the biggest winning combination, while getting three bonus symbols will activate the Free Spins feature.\nSo, feel free to give these titles and more a go on this page. It's a great way to find out about a game before depositing money and you have nothing to lose!",
        "note": ""
      }
    }
  },
  {
    "title": "Blueprint Gaming",
    "logo": "https://static.casino.guru/pict/123942/Blueprint_white.svg?timestamp=1663484023000&imageDataId=374660",
    "provider_info": {
      "About Blueprint Gaming games": {
        "text": "Blueprint Gaming was launched back in 2001, right around the time that online games were starting to take off. The plan was simple: to create fun, easy-to-play digital titles that would prove a hit with internet casino players.\nThe plan worked. In 2008, major German company Gauselmann group purchased half the company to become the majority shareholder, followed by a complete takeover four years later. Gauselmann had an international outlook and Blueprint games started to appear in a number of markets around the world.\nAs well as its headquarters in London, Blueprint also built an office in Malta, a hub of internet gambling. Its gaming certificates reflect these locations, with the Gambling Commission (GC) and the Malta Gaming Authority (MGA) being the two bodies whose safety standards they abide by.\nToday, Blueprint's network of partners and customers puts it up there as a prominent developer known for creating fresh-looking and enjoyable titles. They also provide a series of Megaways slots that offer players thousands of ways to win, and huge progressive jackpots. In May 2021, a lucky individual scooped €8.1 million in Blueprint's Deal or No Deal game.",
        "note": ""
      },
      "Blueprint slots": {
        "text": "Blueprint's focus on vivid designs and innovative gameplay means that it has many popular slots that you can play on in a variety of online casinos with Blueprint games.\nCrypt of the Dead is one that has stunning visuals, taking the player on an adventure into a crypt full of ancient Egyptian treasure. The special symbols are golden figures and jewellery, which expand across the reels in the bonus round to activate impressive wins. The Crypt symbol is the best one to get, and three of these will get you free spins. The game has Blueprint's trademark slick design, and its background music does a good job of building the tension as you spin.\nAmong Blueprint's Megaways slots, Sweet Success Megaways stands out as a fun slot with those thousands of ways to win. No doubt inspired by Candy Crush, this fun game leads to a cascade of sweets every time you land a win, which builds up a win multiplier in the shape of a candy tube at the side of the reels. The Sweet Success logo is the wild, and you'll get a juicy win if you land six of them. The three Pick ‘n' Mix features are the highlight, though: these trigger sweet cascades that replace the winning symbols with a whole new set of icons to land you extra wins.\nBlueprint also offer a number of slots based on movies, with Sausage Party being one of them. This game offers a remarkable 13 bonus features, including Frank's Hot Dog Wilds where any of the reels randomly turn wild and a Still Fresh feature where you have to choose a pack of sausages to reveal your fate. Ted and Mars Attacks! are among other movies that received the Blueprint treatment.\nYou can play all of these titles on this page, plus many more. Just scroll through the selection and pick the one that takes your fancy: there's no need to sign up to a casino or pay a deposit – just click and play.",
        "note": ""
      }
    }
  },
  {
    "title": "Pragmatic Play",
    "logo": "https://static.casino.guru/pict/124086/PragmaticPlay_white.svg?timestamp=1658212054000&imageDataId=346524",
    "provider_info": {
      "Information about Pragmatic Play games": {
        "text": "Pragmatic Play has been a leading multi-product content provider in the iGaming industry since 2015. Its portfolio includes casino table games and live dealer titles, as well as the in-house slots games that we'll talk about on this page. The company's Enhance gaming solution also offers operators the chance to use an in-game promotional tool to improve the playing experience.\nSince its inception, Pragmatic Play's slots and games have attracted industry recognition with several awards from the likes of EGR, IGA and MIGEA. The latter, informally known as the 'Oscars of gaming awards', is particularly prestigious and Pragmatic's 'Best Gaming Company' award there underlines their respected status.\nIt's a status that is backed up by a variety of gaming licenses. Over 20 jurisdictions, including the Malta Gaming Authority and the UK Gambling Commission, recognize the company as a safe and reliable gaming provider.\nPart of Pragmatic Play's success has been its ability to shine in several countries, such as the tough US market. Its presence extends as far as Latin America, Africa and Asia (including an office in the Philippines) which cements its reputation as a truly international entity.\nPragmatic Play's games come in mobile form, so you'll likely find them in mobile casinos, and they're translated into over 30 languages and currencies, making them accessible to players all over the world.",
        "note": ""
      },
      "Pragmatic Play games": {
        "text": "Pragmatic Play has a lot of expertise in Bingo and casino table games, but it also offers an excellent range of modern slot games to its customers. With great aesthetics throughout and an impressive selection of bonus features, Pragmatic slots score highly among players.\nYou can try out many of them for free on this page, as a kind of 'test drive' before playing them for real money. A popular Pragmatic slot is Pirate Gold – a swashbuckling adventure that takes you to the high seas, with the sound of crashing waves to set the scene. These great visuals are backed up by two superb features: Free Spins and the Lucky Treasure Bag. Also, watch out for the male and female pirate symbols: five in a row might net you a big prize.\nDragon Kingdom is another title with great bonus features, although its graphics are a little more dated. Once you start playing, you'll see several mythical figures and you need just two of the same to form a winning line. The warrior is the most valuable, leading to the best prizes. To get the Free Spins feature, you'll need three or more scatter symbols anywhere on the reels to get five spins, and from there you can increase your reward with several multipliers.\nPragmatic Play also offer several Megaways games: a special reel modifier developed by Big Time Gaming which increases the number of ways to win. The Dog House Megaways is one such game – a slot that will delight many dog-lovers, and perhaps annoy everyone else. The reels feature dogs of various breeds as they spin. The game is sharp and engaging, and you can get two Free Spins features and a Wild Multiplier, which can land you over 100 times your prize.\nAside from slots, there are also several Pragmatic Play table games you can try, including roulette, blackjack and baccarat titles. Each one is typical of Pragmatic's trademark bright design and catchy gameplay.",
        "note": ""
      }
    }
  },
  {
    "title": "IGT",
    "logo": "https://static.casino.guru/pict/124010/IGT_white.svg?timestamp=1662360251000&imageDataId=368961",
    "provider_info": {
      "Information about IGT games": {
        "text": "IGT, or International Game Technology, has been around for many years and is one of the best-known names in the iGaming industry. It was originally a Las Vegas-based gaming manufacturer, supplying slot machines and other technology to land-based casinos across the United States.\nThe 1990s saw IGT listed on the New York Stock Exchange as they expanded their services abroad to countries such as Argentina and South Africa. It was a prosperous time for the company marked by the stunning success of its Wheel of Fortune progressive slot, based on the hit TV show of the time.\nThe company's universal presence in bricks-and-mortar establishments around the globe meant that there wasn't a huge focus on internet games until 2010, several years later than many other providers. This was when they established an interactive division with the aim of growing their online operations, and IGT fans had a range of exciting virtual games to choose from.\nHowever, the next few years would see the company suffer from internal disputes and heavy debt, which led to Italian firm Gtech acquiring them for $6.4 billion (including $1.7 billion assumed debt) in 2015. The new-look company, now based in London, had an ambitious outlook, aiming to dominate the iGaming market.\nToday, it continues to release both land-based slots and lottery games across multiple platforms, continuing its status as a leading casino content provider.",
        "note": ""
      },
      "IGT slots and casino games": {
        "text": "IGT knows a successful formula when it sees one, which is why you'll see several variations of its famous Wheel of Fortune slot game. Its Exotic Far East version is one that holds a progressive jackpot along with plenty of bonus games, such as the special Ca$h Link feature, which is activated when you land both special coin and treasure chest symbols. The amount you win depends on the value of the coins. Wheel of Fortune symbols and a treasure chest will give you a spin on the jackpot wheel, the highlight of the game. The game is action-packed and designed to entertain you with its Far-East design and music.\nAnother popular IGT title is Cleopatra, a slot based on the famous ancient Queen. Like Cleopatra herself, the reels are draped in jewels and decorations, and the bright graphics and symbols are attractive to play on. In terms of gameplay, however, it's pretty ordinary. The bonus round is simply free spins and a multiplier, while the Wilds symbol (a logo of the queen) is nothing special. It's a hit with slots players, though, so give it a go to see if you like it as much as others do.\nFor those looking for a fun take on things, then IGT's Ghostbusters-themed slot is a great way to pass the time. Surprisingly life-like symbols of the team are displayed on the reels, along with the foursome's famous car and ghostbusting equipment. There are four bonus games, with the highlight being the 4 Mystery feature – a Wild Reels win here can lead to big gains. Also, watch out for the farting ghost when wins are paid out, something that will amuse the childish ones among us.",
        "note": ""
      }
    }
  },
  {
    "title": "Quickspin",
    "logo": "https://static.casino.guru/pict/124092/Quickspin_white.svg?timestamp=1662360426000&imageDataId=368981",
    "provider_info": {
      "Information about Quickspin games": {
        "text": "Quickspin came to life in 2011 as a collaboration between three Swedish entrepreneurs who all had extensive experience in the gaming industry. Their aim was to create state-of-the-art slots games for the growing internet market, but they wanted to stand out from tried and trusted techniques used by established providers.\nThe start-up quickly developed a reputation for innovative titles; slots that the owners themselves wanted to play, according to the official Quickspin site; and their unique designs and imaginative gameplay saw the company rise to the ranks of industry leaders within a few years.\n2016 marked a milestone for Quickspin when iGaming giants Playtech moved in with a takeover offer. The €50 million deal led to a huge expansion of Quickspin's scope, with new offices cropping up in Malta and Kiev and a workforce of over 100 employees. The company's portfolio of games grew accordingly; several of them won ERG awards and helped put Quickspin in Sweden's Deloitte Fast 50 companies.\nSince then, Quickspin's output has been prolific. The company releases a new slot game every month and many of these earn official recognition in the form of appearances at high-profile gaming conferences and special awards. The content is backed up by licenses from the Malta Gaming Authority and the UK Gambling Commission, so you can be sure that Quickspin games are ultra-safe to play on and follow all the required betting protocols.",
        "note": ""
      },
      "Quickspin games": {
        "text": "Quickspin are known for their forward-thinking gamification approach to their slots, and central to this is their Achievements Engine product. This module powers several special features, where players receive Quickspin tokens for completing special tasks: they can sometimes even track their progress and exchange these tokens on a separate page integrated into the game. You can also play Quickspin slots on mobile devices just as easily as on desktops and, as such, they're a common feature in mobile-friendly casinos.\nThe first slot to incorporate the Achievements Engine was Sakura Fortune which you can still try out for free, along with many other Quickspin titles, on this page. It's hard not to feel a sense of serenity as you step into Princess Sakura's world, with a soothing soundtrack and a backdrop of blossom trees. Look out for the 4x1 Princess Wild symbols to drop on the reels – these can trigger the Sakura Fortune Respin, while the yellow fan bonus symbol leads to free spins.\nPolar Paws is a more recent slot that also uses the Achievements module. The slot is set in a winter wonderland of cute polar bears and elves with festive jingle bells music to boot. The Polar Bears Turn Wild feature is one way to a big prize where the Elf Scatter symbols transform Polar Bear icons into Wilds to get you into the bonus game.\nWhile Quickspin doesn't have any traditional casino tables like blackjack or roulette in its repertoire, it does take inspiration from the slot machines of the past. Second Strike is a prime example of this, with its juicy fruit and 7s symbols set against a slick futuristic background. The game stands out from the old classics with its Second Strike feature: this revolves around a gameboard that runs around the reels, where symbols light up each time you win. Your payout then depends on the symbols combination you land.",
        "note": ""
      }
    }
  },
  {
    "title": "Evolution Gaming",
    "logo": "https://static.casino.guru/pict/123972/evolution_gaming_dark.png?timestamp=1653405907000&imageDataId=127494",
    "provider_info": {}
  },
  {
    "title": "Yggdrasil Gaming",
    "logo": "https://static.casino.guru/pict/124168/Yggdrasil_white.svg?timestamp=1662360620000&imageDataId=369003",
    "provider_info": {
      "Information about Yggdrasil Gaming games": {
        "text": "When Yggdrasil Gaming acquired its first license with the Malta Gaming Authority in 2013, not many people had heard of them. Fast forward a few years and they became known as a respected provider, supplying games for some of the planet's most famous operators.\nBased in Malta, they pride themselves on their impressive HTML-powered iSense platform that gives operators and players the chance to run high quality content seamlessly on mobile devices. This has delivered them three consecutive Innovator of the Year titles at the International Gaming Awards, and five EGR awards for casino content between 2015 and 2019.\nThe company's quality is underlined by their commitment to several other licences that they have added to their initial Maltese certificate. Their collection now includes badges from the GB Gambling Commission, the Gibraltar Regulatory Authority and the National Gambling Office in Romania.\nIt also means they hold many strategic partnerships with iGaming providers so that their content finds new markets and they get access to new ideas and strategies. For this reason, you're likely to find Yggdrasil-designed games in many places on the net, and it's why they hold such an outstanding reputation in the industry.",
        "note": ""
      },
      "Yggdrasil casino games": {
        "text": "The vast majority of Yggdrasil casino games are beautifully designed slots titles that appeal to all types of players. A quick browse through their selection on this page will bring a host of bold, colorful titles to your eye, with games like Double Dragons jumping out.\nThis game in particular is a pleasure to look at, with some wonderful animations in front of a daunting fiery backdrop. The game itself is stimulating to play; its five reels and twenty playlines offering glittering icons and exploding blocks. Four consecutive wins in the base game triggers the Double Dragons feature where red and blue dragon heads, symbolizing fire and ice, enter the reels and combinations of these can lead to wilds payouts and free spins.\nSpina Colada is a cuter offering that offers simpler graphics and the more chilled setting of a beachside bar. Here you can collect four feature caps of the same kind to activate great bonus features such as Extra Wilds, Second Chance and Guaranteed Win x 3. There are also free spins thrown in for different sequences during the base game, which is super pleasant to play with its fruity symbols and relaxed music.\nFans of superheroes are also catered for with the predictably titled Super Heroes. Here a dystopian landscape greets you after a superb 3D opening sequence of six superheroes tasked with fighting evil. The five reels of the game itself feature the bad guy characters that they're up against and symbols that combine to trigger different superhero features. Depending on the feature, you can get extra wilds, free spins or 50x instant wins. While the jackpots aren't progressive, you can still win an impressive amount for your efforts.\nSo, if it's a varied selection of exciting, easy-on-the-eye slots games that you're looking for, then Yggdrasil doesn't disappoint. You can try out their games for free on this page, before deciding whether you'd like to play for real.",
        "note": ""
      }
    }
  },
  {
    "title": "Igrosoft",
    "logo": "https://static.casino.guru/pict/13305/Igrosoft_white.svg?timestamp=1663483123000&imageDataId=374621",
    "provider_info": {
      "About Igrosoft games": {
        "text": "If you're not from Russia, then you probably won't have heard of Igrosoft. Despite being formed way back in 1999, the company has generally flown under the radar in the iGaming industry, despite there being a wide range of online casinos that offer Igrosoft games in their selection.\nThere could be several reasons for this low profile. Their website looks like it hasn't been updated since Igrosoft's formation in the 1990s, and they only have a handful of games for players to try out on there. It doesn't announce many news items, doesn't use social media and rarely releases new games.\nThat said, Igrosoft games run on software that uses HTML technology — despite their website saying it uses the now-defunct Flash — so players can play on mobile devices, as well as desktops, without seeing a big drop in quality. The company is noted for its software development, and it appears to be up to date with modern iGaming requirements.\nIn 2020, Igrosoft successfully passed Random Number Generator (RNG) certification at iTech labs, an accredited testing laboratory. This certificate confirms that all Igrosoft games are completely random and not rigged to con the player out of their hard-earned cash.",
        "note": ""
      },
      "Igrosoft games": {
        "text": "Igrosoft games tend to reflect their creator company in terms of appearance: simple, straightforward and slightly outdated. Having said that, they're super easy to play and are reminiscent of classic slots titles that are hugely popular with players.\nCrazy Monkey is probably the most famous Igrosoft slot. Set on a jungle backdrop, you simply spin the five reels of animals, fruit and tribal masks to find a winning combination. Once you get one, you can choose to 'Take or Risk' the prize, giving you the chance to boost your win. There are also bonus and super bonus games should you get lucky. The game's success led to a Crazy Monkey sequel which follows a similar format just with sharper graphics and quicker gameplay.\nThe rest of Igrosoft's slots games all tend to follow a similar formula. One that stands out, though, is Gnome: a game that takes you to the cave of the gnome central character. The reels are the gnome's way of mining for riches, which for him are minerals, and for you is a Wild symbol, a bonus game and, hopefully, a cash prize. Like all Igrosoft slots, you get the chance to increase this prize with 'Take or Risk'.\nFeel free to try all of these Igrosoft titles out on this page for free: many players choose to do this so that they can enjoy the games without paying a cent, plus it lets them get to grips with how they work should they stake money in the future. If you're looking for new Igrosoft releases, however, you might be waiting a while.\nUnfortunately for table games fans, Igrosoft don't offer any classic casino games amongst its collection, so for roulette, blackjack and video poker titles, you'll have to look elsewhere.",
        "note": ""
      }
    }
  },
  {
    "title": "Realtime Gaming",
    "logo": "https://static.casino.guru/pict/124098/Realtime_white.svg?timestamp=1663483263000&imageDataId=374630",
    "provider_info": {
      "Information about Realtime Gaming games": {
        "text": "Launched in Georgia, USA, in 1998, Realtime Gaming (RTG) were one of the first gaming providers to 'go digital', offering content solely for internet platforms from the start.\nTheir pioneering software was an industry favorite in the early 2000s, powering many early betting sites and paving the way for an established range of RTG online casinos today. They won awards, expanded their reach and frequently added to their game collection during this time.\nIt hasn't all been plain sailing, though. In 2004, RTG was embroiled in a huge dispute with a player who they accused of cheating his way to around $1.4 million with an automated program. The company had no proof of this, and there was a hidden out-of-court-settlement to resolve the case - but it cast RTG in a doubtful light. They limited bet sizes to $5 as a result.\nFurther upheaval followed in 2007, when Hastings International of Curaçao acquired the company and relocated to Costa Rica following the introduction of the Unlawful Internet Gaming Enforcement Act (UIGEA) in the USA. While this move may look suspicious, several other providers also left the country, complaining of what they deemed to be overly strict conditions.\nToday, despite the previous controversy, RTG remains a prominent casino content supplier, holding a Curaçao license thanks to its owner's location. Its game collection features several styles, including table games and a diverse collection of slots, which you can try out for free on this page.",
        "note": ""
      },
      "Realtime Gaming slots and casino games": {
        "text": "Slots titles form the bulk of RTG's gaming range, and many of them are video slots powered by the company's software, which can also be played in mobile devices through many mobile-friendly casinos.\nCash Bandits 2 is one of these, taking players on a journey to a world of cops 'n' robbers. The graphics are a level above many RTG titles, with a crisp look to the game, and players can win by landing sequences of crime-related symbols. The 'robber' is the scatter, which can form wins multiplied by the total bet - get 3 of these and you'll trigger Vault feature full of free spins.\nAlthough not a progressive slot, Popiñata is a fun choice, with its Mexico-inspired theme and jolly music. The game revolves around a Wild Donkey Piñata, based on the Mexican toy which Mexican children beat to get candy. Your job is to get wilds from it, where it bursts open to reveal a re-spin. If you get three reels with expanded donkey symbols, then you're on for a big prize.\nAlternatively, one of RTG's most popular slots is Bubble Bubble 2. Based in a young witch's lair, you can trigger a special feature by landing three wand scatter symbols. You can then choose from the Greater Ghosts, Wilder Witches and Ultra Brew options to land a range of freebies and wilds.\nIf you're looking for table games, then there are also a few RTG titles to check out, with blackjack, hold'em poker, baccarat and even pontoon catered for.",
        "note": ""
      }
    }
  },
  {
    "title": "Nektan",
    "logo": "https://static.casino.guru/pict/124052/Nektan_white.svg?timestamp=1663497077000&imageDataId=374882",
    "provider_info": {
      "About Nektan games": {
        "text": "Nektan is a successful gaming developer based in the UK. Since its formation in 2014, it has provided white-label software and games to operators in many different countries and is recognised as an AIM company on the London Stock Exchange.\nKey to its success has been its partnerships with other companies that have helped it build a productive network. A deal with The Sun Play is probably its most well-known, with the platform running Nektan games and bringing them a great deal of exposure. You'll also find their games in many Nektan online casinos thanks to their popularity among players.\nTo back up its expansion, Nektan has added a string of licenses to assure customers of its commitment to quality and fair play. These include certificates from the UK's Gambling Commission and the Gibraltar Licensing Authority. Since 2015, it has also been ISO certified which further boosts its reputation.\nNektan's game range includes table games, live casino and scratch games, but it's its slots selection that attract the most attention, and you'll be able to play several of them for free on this page.",
        "note": ""
      },
      "Nektan slots": {
        "text": "If you scroll through Nektan's game selection, you'll see a common theme of a bold, colorful font and larger-than-life characters. In Cave Raiders, for example, you're accompanied by a character who resembles movie hero Indiana Jones – with theme music to match. The game is fun to play, although lacking a little in features. Land three matching symbols to get free spins and keep an eye out for the golden statue icon which acts as the Wild. A 1,000-coin jackpot is the ultimate prize you can win on each of the game's 25 winlines. There's also an updated HD version available, just in case you're after crisp graphics.\nPlucky Pirates adopts a similar adventure-based theme as it takes you on a journey over the high seas. Landing three of the canon symbols anywhere on the reel will get you free spins, but the real big win comes when you connect five 'Plucky Pirate' lines on the same pay line. Like with many Nektan titles, the game is very pleasing on the eye which means you're likely to have fun, even if the game is again lacking features.\nDespite the abundance of video slots and advanced features around today, there is still a demand for the classic slots of yesteryear. Nektan caters to this with its Get Fruity slot, a simply designed game that treats you to bright fruit symbols and arcade-style music. The aim is just to land those combos that get you wins, without the complication of gamble games or bonus rounds. You'll get the joy of playing an old-fashioned game on 21st-century technology, including on a mobile-friendly casino, thanks to HTML-5 technology. That's something that slots players 30 years ago couldn't do.",
        "note": ""
      }
    }
  },
  {
    "title": "Thunderkick",
    "logo": "https://static.casino.guru/pict/124148/Thunderkick_white.svg?timestamp=1662360594000&imageDataId=368999",
    "provider_info": {}
  },
  {
    "title": "Red Tiger Gaming",
    "logo": "https://static.casino.guru/pict/124102/RedTiger_white.svg?timestamp=1662360438000&imageDataId=368983",
    "provider_info": {
      "Information about Red Tiger games": {
        "text": "Since Red Tiger's formation in 2014, its team of industry experts have earned a reputation for producing exciting slots titles for the online casino industry.\nTheir collection has steadily grown to include well over a hundred games, as well as a string of awards from top iGaming panels. Their prestige within the industry led to the famous NetEnt company acquiring them in 2019; a combination that offers top slots expertise together with a global distribution network.\nCentral to their game technology is an internally-produced RTG Core casino engine, which boasts impressive frames-per-second (FPS) rates to achieve a high-quality, smooth gaming experience for players.\nAs well as boasting extraordinary graphics and seamless gameplay, Red Tiger games are also committed to high industry standards, holding licences from gaming authorities in Gibraltar, Malta and the UK.\nRed Tiger have also forged many strong partnerships with betting and iGaming websites due to their reputation, including a large number of online casinos with Red Tiger games, and their presence looks set to expand under NetEnt's ownership. You can try out many of these games for free on this page, so you can get to know them before putting down a deposit.",
        "note": ""
      },
      "Red Tiger slots and casino games": {
        "text": "Red Tiger are famous for their slots, which are excellent fun to play. They always boast an eye-catching appearance and the temptation of lucrative prizes.\nOne of their most famous titles is Vault of Anubis — a voyage into the tomb of a fallen Ancient Egyptian god. The highlight of this is the Vault Spins feature, which is activated once you collect all the spins symbols on a meter at the top of the screen. Starting with ten free spins, you have the chance to land unlimited multipliers, and extra spins each time a '+ Spin' symbol appears. Adventure fans will love the suspenseful music and dramatic backdrop to this game.\nFor something totally different to that, Lucky Little Devil is based around a cute little pink devil, who invites you to its fiery lair to spin the reels. Its friendly appearance is backed up by its easy set-up; you just need three matching symbols to get on one of the pay lines. Three Lucky Little Devil symbols will activate the free spins, which usually number around ten.\nFairy tales are another Red Tiger theme, with Cinderella, Puss in Boots and Snow White appearing among their collection. The latter, in the form of Snow Wild and the Seven Features, is a particularly fun experience. Don't be fooled by the cutesy appearance: this is a rock 'n' roll version of the tale, with drinking dwarves, pots of money and raucous cheers. Look out for the Lucky Wheel that triggers the seven bonus features named after the dwarves and Snow Wild, including Boozy (wilds), Tickly (reel re-spin) and Snow Wild (features combo).\nFor those looking for non-slots fun, Red Tiger's options are limited, but it's still possible to enjoy blackjack, including a Deal or No Deal themed version, and roulette games in their selection. These are also very nice to play thanks to Red Tiger's great software, so it could also be an enjoyable way to pass a bit of time.\nAway from slots, there are also classic casino table games such as European Roulette and Classic Blackjack which benefit from Red Tiger's excellent design and smooth gameplay.",
        "note": ""
      }
    }
  },
  {
    "title": "Betsoft Gaming",
    "logo": "https://static.casino.guru/pict/123927/Betsoft_white.svg?timestamp=1662360057000&imageDataId=368938",
    "provider_info": {
      "Information about Betsoft games": {
        "text": "Since their formation in 2006, Betsoft have developed a reputation for providing quality casino software and games. With over sixteen years' experience in the industry, it's no wonder that Betsoft's game portfolio consists of 200+ titles offering feature-rich and immersive play.\nFrom hugely popular series to sequels including Return to Paris and Lost Mystery Chests, Betsoft designs immersive content that is known for big bets wagered and time spent playing. Offering themes such dark magic, gods, dinosaurs, time travel, and many others, Betsoft's game portfolio has a variety of engaging mechanics, features, bonus rounds, multipliers, plus a proven maths model.\nCertified by the Malta Gaming Authority, Romania, Danish Gambling Authority as well as Italy and Spain, Betsoft also acquired licenses across multiple jurisdictions, including LATAM and Africa, along the way.\nIn January 2022, Betsoft launched its first in-game promo tool with real time gamification. The customizable tool - Take the Prize - was created to add significantly to the overall player experience in iGaming, increase player engagement, and offer big prizes without interrupting gameplay. Betsoft also ensured that, as a visually high-impact product, Take the Prize is especially mobile-friendly and compatible across all devices.\nToday, Betsoft's skilled team of engineers and developers serves an expansive range of customers in Europe, Asia and the Americas and continues to release excellent slots, many of which you can try out for free on the Casino Guru website.",
        "note": ""
      },
      "Betsoft Slots & Casino Games": {
        "text": "Known globally for its Mobile First mindset, great 3D animations, and highly engaging storylines, the company has won multiple awards for its games, including Five Star Slot Provider of the Year, Casino Supplier of the Year, iGaming Media RNG Casino Supplier of the Year, and many more.\nFocused on quality rather than quantity in the creation of video slots as well as signature features, Betsoft's portfolio includes series such as the 'Take' games (Take the Bank, Take Santa's Shop, Take Olympus, Take the Kingdom, with more in design).\nAlong with the 'Pop' games (Sugar Pop, Sugar Pop II: Double Dipped, Chilli Pop, and Monster Pop), these releases create real engagement with players through a mix of volatility and variance across the portfolio. Other slots such as Dim Sum Prize, part of the Red Dragon series, and the Safari Sam games all offer above average RTPs as well as signature graphics.\nBonus features, progressive jackpots, multipliers, and free spins are built-in features in many games. Other releases have a base game that explodes into a second screen bonus once the features are triggered – Mr Macau, Stacked, and all the 'Take' releases bring a new meaning to immersive play.\nBetsoft offers 99.98% uptime in over 500 casinos globally. All releases are mobile-friendly with quick loading times and lightweight deployment. They are compatible across platforms and devices with no loss of quality in imagery.\nBetsoft games are verified by all leading certification houses including GLI and iTech Labs. In addition to slots, Betsoft offers table games such as poker, blackjack, roulette, and many others. With 3D graphics and an evocative soundtrack, they bring the thrill of the casino to you.",
        "note": ""
      }
    }
  },
  {
    "title": "Rival",
    "logo": "https://static.casino.guru/pict/124108/Rival_white.svg?timestamp=1662360449000&imageDataId=368985",
    "provider_info": {
      "About Rival games": {
        "text": "Rival is an international supplier of casino games and software, offering an innovative slots range, including the famous i-slots, on their specialized platform Rival Powered.\nThe company made headlines back in 2006, officially launching at top gaming event GiGse after two years of hard work behind the scenes. The Rival brand gained a reputation for enjoyable, user-friendly titles and it continued to increase its collection over the following few years.\nThe announcement of the new i-slot games, however, moved things up a gear. Building on the regular slots format, these titles boasted immersive storylines and intriguing characters. Instead of just spinning reels, players could be a part of a storyline by navigating bonus rounds and landing certain winning combinations.\nWhile the success of the i-slots was impressive, Rival also saw the value in quick and easy play, and it launched a Mini-Games selection in 2012. These were aimed at players who wanted a n0-frills experience, but the games still came with some nice touches.\nRival continues to add to its gaming stock today and has a lot of titles for players to choose from. You can try many of these out for free on this page, meaning you get the chance to 'test drive' them without going through the trouble of making an online casino deposit. The next section will look at some of the most intriguing.",
        "note": ""
      },
      "Rival games": {
        "text": "If you're looking for something with a storyline, then Reel Crime: Bank Heist is a good i-slot to start with. The game is divided into four stages of a bank robbery which you can view on an interactive map. Your mission is to navigate your way through these to pull off a heist, including finding a key to the bank, unlocking a safe, then running from the police. Look out for the different Scatter symbols, which could be a Tommy gun, dynamite or a cop, depending on which stage you're at. They trigger free spins that might also lead to multipliers and some big wins to go along with the superb gameplay.\nA less elaborate, but still entertaining Rivals slot is Smoking Gun. The emphasis here is on landing matching symbols on the reels, which spin to the sound of a Wild West-themed soundtrack. If successful, your payout will be determined by how many matched symbols you have, and the values displayed on the pay table. This game is perfect for players who aren't looking at complex features and an elaborate storyline.\nRival also has several classic casino games such as roulette, blackjack, video poker and even bingo for players to try out. These follow the company's general aesthetic of a bright, simple design and easy gameplay. You can find these by going to 'Game Type' and clicking the box next to the game of your choice.",
        "note": ""
      }
    }
  },
  {
    "title": "Big Time Gaming",
    "logo": "https://static.casino.guru/pict/123940/BigTimeGaming_white.svg?timestamp=1662360098000&imageDataId=368941",
    "provider_info": {
      "Information about Big Time Gaming games": {
        "text": "Big Time Gaming, also known as BTG, started trading in 2011 when a small group of gaming experts pooled their talents together to form a collective focused on providing innovative online casino content.\nTheir CEO Nik Robinson has been in the industry since the mid 90s, when he founded New Tech Media, which went on to be snapped up by News Corp and later became part of a merger to form Openbet. They also boast the talent of Ian Schmidt, who has an impressive track record with Rock Star Games.\nFrom their base in Australia, they supply content to some of the biggest names in the iGaming industry. The company has also acquired a series of licenses that allow it to operate in different markets. Other than the common, but important, Alderney and Malta certificates, it's also permitted to provide content for government lotteries, as well as branded titles based on successful TV shows and franchises.",
        "note": ""
      },
      "Big Time Gaming casino games": {
        "text": "Most of Big Time's game selection are slot titles that show off a larger-than-life aesthetic. Nowhere is this more evident than their Megaways slots, including the world-famous Who Wants to be a Millionaire?\nFollowing the same format as the show, minus the host, the quality of the music and graphics makes you feel as if you're sitting in that black chair yourself. The game itself is entertaining, too, with an intriguing Mystery Box feature available from the start. The sharp symbols on the six-reel grid spin form winning lines and trigger features based on the show itself, such as the Hot Seat Free Spins gamble, where you make your way up a prize ladder, lifelines that give you extra chances, and even a Walk Away option where you get free spins without gambling.\nAnother Megaways title worth trying out is Bonanza. Featuring a nice-looking setting of a six-reel grid built into a grassy cliff, the game revolves around a 'gold rush' concept, with symbols etched into rocks and even gold carts that represent a bonus reel through which you can activate a wild. The bonus game is excellent, if a little hard to get: the background turns into a fiery night setting where the multiplier increases after each win, giving you the potential to collect some huge wins.\nBig Time also offer some nice non-Megaways titles. Opal Fruits is one of those, giving you the chance to try out its six reels in a slick, space-themed setting, with futuristic music to match. Once you win a prize, you trigger a process in which the winning symbols are replaced by falling icons to form new win lines. Golden scatter symbols give you free spins with unlimited multipliers, and there are multiplier wilds which increase your win several times. It's a great example of Big Time's focus on excellent graphics and engaging gameplay, and you won't notice the time go by as you become immersed in the game.",
        "note": ""
      }
    }
  },
  {
    "title": "WMS",
    "logo": "https://static.casino.guru/pict/124162/WMS_white.svg?timestamp=1663484279000&imageDataId=374673",
    "provider_info": {
      "Information about WMS": {
        "text": "WMS Gaming has a long history in the gaming industry, stretching all the way to 1943 when Harry Williams founded its parent company, Williams Manufacturing, in Chicago. The company initially produced pinball machines and then extended its range to include slot machine and video lottery terminals as the world became more technological.\nIts first slot title appeared in the mid-90s under the name Reel 'Em In, which was the first ever game with a second screen bonus round. Its success meant other titles quickly followed, and in 1999, WMS formed a division dedicated exclusively to gaming: WMS Gaming. With its built-in bonus systems, it was ideally placed to ride the crest of the online boom over the following decade.\nA big part of its success was a series of 'participation' branded slots which carried the title of famous names, such as Monopoly and The Lord of the Rings. These traversed the physical and online formats, proving to be popular in both, and established WMS Gaming as a leading name.\nKeen to take advantage, Scientific Games Corporation came calling 2013. The gaming giant bought out WMS for $1.5 billion, effectively absorbing it into its interactive division. As such, all WMS content follows the strict code of conduct put in place by Scientific Games, which means all of its content is held extremely high standards and is safe to use.",
        "note": ""
      },
      "WMS Games": {
        "text": "WMS Gaming's extensive experience in the gaming industry means it knows how to make excellent games. Together with Bally and Shuffle Master, they contribute to one of the largest game libraries in the world, which often features some of the latest technology.\nIn terms of slots, its branded selection stands out. Super Monopoly Money, for example, is a variation on WMS's wildly successful slot of the early 2000s. The game is bright and snappy, featuring all the classic symbols, such as the hat, dog and shoe, on a nice backdrop of the Eiffel Tower and Big Ben. It also has some impressive bonus features including Free Parking icons that land on the reels: you select one of five cards to show another symbol, which replaces the Free Parking icons– your prize depends on which symbol you get.\nAway from branded slots, WMS also has a good range of original titles. Jumpin' Jalapenos is one of those, which offers a great free spins feature. Get three or more jalapenos across the five reels to activate them, with the 'Mexican Man' Wild symbol increasing the win amount. If you're looking for brilliant graphics though, you might be disappointed: JJ's aesthetic is pretty dated.\nFor a step up in graphics, Jungle Wild is a popular WMS slot that takes place deep inside a rainforest. The reels appear from behind super-sized tree leaves and your goal is to unlock the golden temple there and escape with some riches. Central to the game is the free spins mode that comes with a guaranteed win every time you trigger it.\nYou can try out all of the above slots on this page at no cost: just click on the game and play. What's more, if you'd like to see a varied selection of real-money casinos with WMS games, go to our list of WMS Gaming casinos.",
        "note": ""
      }
    }
  },
  {
    "title": "Scientific Games",
    "logo": "https://static.casino.guru/pict/124117/SCGaming_white.svg?timestamp=1662360466000&imageDataId=368988",
    "provider_info": {}
  },
  {
    "title": "iSoftBet",
    "logo": "https://static.casino.guru/pict/124021/iSoftBet_white.svg?timestamp=1662360269000&imageDataId=368963",
    "provider_info": {
      "Information about iSoftBet": {
        "text": "ISoftBet is a major iGaming operator that produces online casino software and games for clients around the world.\nBased in London, with a second office in Luxembourg, it holds a range of top licenses that allows it to operate in many different markets. These include the Malta Gaming Authority, and the UK Gambling Commission certificates; two of the most sought-after badges of honor that show a commitment to player security and high-quality content.\nThe iSoftBet game library is huge, with over 2000 third-party games complementing their in-house titles. All of these are available through its Game Aggregation Platform (GAP) and include classic casino games, table games, and branded slots. Their slots selection also contains some Megaways titles, popular with players for their high number of ways to win and entertaining playing style.\nVarious successful partnerships mean that iSoftBet has enjoyed great success over the last decade, with appearances at leading conferences such as ICE London where the public can try out iSoftBet games for the first time. You can also try them out, although a little later than ICE attendees, on this page. All games are free, so you'll be able to enjoy their entertaining gameplay and modern aesthetic without paying a single cent.",
        "note": ""
      },
      "iSoftBet games": {
        "text": "Like with most casino game providers, iSoftBet's library is dominated by slots, with their branded range being prominent among them. 24 is one such offering, an adventurous title based on the Jack Bauer series. Featuring the same tense music and quotes from the man himself, you'll hear a dramatic movie-style noise whenever you land a winning combination. These could take you to a gripping Free Spins game with special wild features, or you may get five Jack Bauer symbols that pay out the top prize.\nIf you're not in the mood for such adventure, then there are more sedate iSoftBet slots in the collection. Fishin' for Gold is a simple yet pleasant game based in the Arctic tundra. Here, catching three fish will land you the free spins bonus game: you choose a fisherman who pulls out a special symbol, and this symbol is classed as wild during the game. Three of anything other symbol will net you a nice cash prize. The game chugs along pleasingly, with a light and cheerful soundtrack behind it.\nAs mentioned, there are Megaways titles available, too, and Aztec Gold Megaways is one of those. Set in an Aztec temple, this modern-looking slot features blocks cascading down the reels and smashing whenever you get a combination. As always, the Megaways reel is in the top corner, informing you how many ways to win you have at any one time. Look out for the Aztec Gold Cash respins – getting five sun discs anywhere on the reels will trigger this, hopefully leading to a big win.\nAs well the many slots games to try out, there are also several iSoftBet table games available. These include some entertaining blackjack and poker variations that offer something a little different to players, featuring names like Joker Poker Big Beer and Blackjack Super 7s.",
        "note": ""
      }
    }
  },
  {
    "title": "Amaya",
    "logo": "https://static.casino.guru/pict/123902/Amaya_white.svg?timestamp=1663483697000&imageDataId=374642",
    "provider_info": {
      "About Amaya games": {
        "text": "If you type ‘Amaya Games’ into Google, then you’ll get a bunch of results about The Stars Group Inc. (TSG), which is down to a full company rebrand in 2017. There are numerous reasons for this, which we can explain by looking at the company’s history.\nAmaya Gaming was formed in 2004. A Canadian enterprise with big ideas, it wanted to surf the crest of the digital wave and create internet casino games to meet growing online demand. Over the next seven years, they forged a reputation for producing excellent content, which led to a huge $4.9 billion takeover in 2011. Rational Group, the parent company of gaming firms Full Tilt and PokerStars, were the buyers, and they integrated Amaya into one of the biggest iGaming companies around.\nBut it wasn’t all plain sailing. In 2017, Amaya CEO David Baazov was charged with five counts of insider trading by one of Canada’s securities regulators. It led to his resignation, but the scandal hit the company hard and made headlines around the world.\nThe takeover and controversy both played a part in the rebrand, and TSG, or TSGI, became the new name of the company within the Rational Group. TSG is now a force in the iGaming scene following a string of successful releases, backed up by an $11 billion merger with Flutter Entertainment in 2019. The merger oversees major betting organisations such as SkyBet and Betfair as part of its operations.\nTSG’s lively casino games are fun to play and backed up by a membership to the UK’s Betting and Gaming Council (BGC) which focusses on consumer protection and safe gambling.",
        "note": ""
      },
      "Amaya Games": {
        "text": "The purpose of this page is to give you the chance to try out some Amaya slots for free – without having to share your details or put down a deposit at one of Amaya online casinos. You’ll see many themes covered in the Amaya range, including themed slots and light-hearted games for those who are looking for a bit of humor.\nKing Kong: Island of Skull Mountain is one such themed slot, and it takes you to the giant ape’s supposed place of birth: deep in the jungle on Skull Island, complete with fearsome animal sounds and a dark atmosphere. The reels feature Gate symbols that burst open to reveal symbols on each spin, and if you land the Gate bonus then the reels will fill with gates that open to reveal a winning set of symbols. The King Kong icon is the wild and has the power to replace other game symbols in its bonus round to create winning pay lines.\nAnother well-known name to feature is a famous Arabian prince, in Aladdin’s Legacy. With its gold backdrop and promise of Eastern riches, the game offers a fun playing experience. Look out for the free games feature, which can give you up to 20 free spins, but overall, the game has a low variance, so the emphasis is on longer playing time rather than massive wins.\nAmaya’s, or TSGI’s, use of modern software means that their games should run smoothly on any device of your choosing. Definitely a good news for fans of mobile casino games. They often include entertaining storylines and interesting jackpots, without breaking the boundaries in terms of design and graphics. Have a go for yourself and see what you think!",
        "note": ""
      }
    }
  },
  {
    "title": "Nextgen Gaming",
    "logo": "https://static.casino.guru/pict/124054/Nextgen_white.svg?timestamp=1663483243000&imageDataId=374627",
    "provider_info": {
      "About NextGen Gaming games": {
        "text": "NextGen has an interesting history. Formed in Australia in 1999, it set out to create land-based casino games, but quickly found that the online market had huge potential. As part of parent company Next Generation Entertainment, it grew inside the Australia market and became one of the country's dominant game providers.\nIn 2011, NextGen merged with Swedish company NYX Gaming, a move that gave the company a foothold in Europe and widened its game selection to over 300 titles. Going from one strength to another, it accepted a huge offer of $630 million from gaming giant Scientific Games (SG) in 2017, becoming SG Digital, the new interactive division, in the process. For this reason, you'll find the SG logo appears when you load up a NextGen game in one of the many casinos with NextGen games.\nAny NextGen or SG game that you play is bound to strict gaming regulations, so you can be sure you get a fair deal when you play. The Malta Gaming Authority, with its respected reputation in the iGaming industry, is one of the licences the company holds.\nToday, SG is regarded as one of the top gaming companies in the world with enormous resources, so don't be surprised to see many new games powered by NextGen's mechanics coming your way.",
        "note": ""
      },
      "Nextgen slots and casino games": {
        "text": "NextGen's range of games is impressive, an output that has been helped by their integration with SG. You'll find them among thousands of others on SGI's Open Gaming System software (OGS) that gives players access to thousands of titles.\nA running theme through the NextGen slots collection is magic and luck, and you'll find leprechauns, pots of gold and wizards scattered across many of its titles. Emerald Isle is an example, with its quaint Irish theme and nice bonus games. The game is very nice to look at and gets exciting if you pick up one of its features: the Free Games bonus gives you up to 20 free spins with trebled wins, while the other lets you choose treasure chests that offer up to 500x your stake. Merlin's Millions and Irish Eyes are similarly themed games.\nYou'll also see many NextGen slots with animal themes, ranging from foxes to gorillas, and even the famous mystical ape-man Bigfoot. Big Foot has a basic but colorful design, taking you on a hunt of the elusive creature. If you get three Bigfoot footprint symbols then you'll activate the bonus game, where you select any pair of eyes in the forest to win a prize. A winning combo of five symbols on the reels can also land you a nice, big cash win. Other titles in this genre are Gorilla Go Wild, Mad Mad Monkey and Foxin Wins, as NextGen look to inject a little fun into their slot games.\nIf slots aren't your thing, then NextGen also has several classic casino games including blackjack and roulette. Double Zero Roulette and Blackjack Pro offer the usual bright visuals and straightforward gameplay that NextGen are known for.",
        "note": ""
      }
    }
  },
  {
    "title": "Playson",
    "logo": "https://static.casino.guru/pict/124080/Playson_new_white.svg?timestamp=1682353040000&imageDataId=499474",
    "provider_info": {
      "About Playson games": {
        "text": "Playson is a leading game developer that is well-known in the iGaming industry for consistently producing cutting-edge slots and casino games. Formed in Malta in 2012, it quickly launched its first batch of games, as well as a turnkey solution for operators.\nSince then, Playson has steadily built up its collection of games, focusing on a bold design and engaging gameplay. It has also extended its sphere of influence outside of Malta, being certified to operate in major European markets such as the UK and Sweden. Its ownership of the Malta Gaming Authority (MGA) license backs up Playson's commitment to safe gaming and high quality standards. Boasting a wide network of partnerships with other companies, it appears to have an ambitious outlook for the future, too.\nNowadays, Playson games are a popular choice for casino players. The company regularly releases new content, and you can play many recent titles for free on this page. This gives you the benefit of trying them out without putting down a deposit and gives you a good idea of what Playson are all about as a company.",
        "note": ""
      },
      "Playson Games": {
        "text": "Playson games are designed to grab your attention with their bright appearance and generous jackpots. Book of Gold is one slot that has both, with its very title hinting at some potential big wins.\nThe game itself has a crisp design and is set within an Egyptian pyramid, with Sphinx symbols and hieroglyphics. The Book of Gold is the special symbol, often combining with other symbols to give quick wins. The free spins mode is the highlight, which is triggered by getting three Books. Here, you are given a special symbol which, when it expands, leads to an avalanche of gold coins and a big, super, or mega win.\nWolf Power is another Playson slot with a strong aesthetic, set against the backdrop of mountains and a night sky. Here, the Wolf Wild symbol replaces regular icons to contribute to winning combinations, and the mountain, sun and coin symbols will lead you to a great bonus game. Playson do a great job of building tension by expanding the grid whenever there's one more symbol left to land, however this is also intended to get you to push that spin button just one more time, so make sure you follow safe gambling guidelines when you play.\nClassic slots are always popular with players, and Playson provide a nice selection of these, too. Super Burning Wins Respin is a bold title which is backed up by bold fruit symbols that are set on fire whenever you land a combo, with the 7s being the most valuable. The respin happens when you fill two reels with the same fruit, and this often lands you a nice win accompanied by some triumphant classical music. The game is nice and smooth to play and, like many Playson slots, is available to play in mobile-friendly casinos thanks to HTML-5 technology.",
        "note": ""
      }
    }
  },
  {
    "title": "Amatic",
    "logo": "https://static.casino.guru/pict/123900/Amatic_white.svg?timestamp=1663483910000&imageDataId=374654",
    "provider_info": {
      "Information about Amatic": {
        "text": "Amatic is an established gaming provider that designs, manufactures and distributes casino equipment and technology to a global network of operators. Founded in 1993, it possesses extensive experience of the market, and its impressive product range is testament to this.\nUnder its full name Amatic Industries, it supplied land-based machines from its Austrian base in the 90s, before expanding into the digital arena as internet gaming grew in influence in the 21st century. The company created a new division, Amanet, dedicated solely to the online sector with many of the interactive games having a classic feel – a sign of the company's land-based past.\nIt proved to be a wise move. Amatic became adept at providing quality online slots and casino games, as well as back-office system which serves as an analytical and marketing toolkit for operators. The company have picked up several awards and expanded their presence in countries as far-flung as Argentina and Peru.\nWhile Amatic don't appear to have any of the more prominent Gaming licenses, such as the MGA certificate, it is a member of the Leitbetriebe Austria, a national authority that demands exemplary behavior from its companies. Amatic's repeated appearances at respected gaming conferences such as ICE London also underlines its credibility.\nAfter such a long history in the industry, it's perhaps no surprise that there's an extensive selection of Amatic casino games and slots to choose from, with the company occasionally adding to the list.",
        "note": ""
      },
      "Amatic slots and casino games": {
        "text": "Delve into Amatic's games collection and you'll find many possessing a classic design, created to appeal to fans of traditional slots games. Wild 7 is one example, with its simple graphics and emphasis on the game itself. It feels very much like standing at a real-life slots machine as the familiar symbols spin in front of you. As always, landing fruit combos gets you wins, each time lighting up the 'Gamble' button, which gives you the chance to play double or quits roulette-style. Wilds symbols lead to bigger wins, while the Scatter symbols pay on any position.\nMoving towards more sophisticated Amatic titles, Grand Casanova stands out as a nicely designed slot based on the legendary lothario. The game's vivid symbols include glasses of wine, romantic gondolas and jewellery, but the Wilds symbol of the man himself is the one to watch out for. Mask symbols, acting as the scatter, trigger a bonus round during which the whole reels become wild if you land a Casanova.\nFor players looking for something a little different to most slots, then Chinese Spider is one to try. Its curious hexagonal reel design includes gem symbols that give wins when they land in sequence. The spider itself is the Wild symbol and multiplies a win up to 32 times, depending on how many of them you get. The game doesn't offer any bonus features, though, which might disappoint some people.\nAmatic also include several poker-based games in their range which offer that typical, no-nonsense Amatic design, which may satisfy the more traditional player.",
        "note": ""
      }
    }
  },
  {
    "title": "ELK Studios",
    "logo": "https://static.casino.guru/pict/123966/ELK_white.svg?timestamp=1663484820000&imageDataId=374716",
    "provider_info": {
      "About ELK Studios games": {
        "text": "ELK Studios is a Sweden-based gaming developer that has been around since 2013. Its team has a quality-based approach to game creation, releasing relatively few titles but giving great attention-to-detail to the ones that they do.\nIn 2016, their Wild Toro slot made the news by winning an award at the EGR gaming awards, which was a reward for the team's hard work. Successive appearances at the ICE gaming event followed, which underlined their credentials as a prominent slots provider.\nELK also hold a range of important gaming licenses from jurisdictions such as the Malta Gaming Authority (MGA) and the Gambling Commission (GC). These confirm their commitment to high safety standards and fair gameplay.\nYou can find many of ELK's slots on this page where you can try them out free of charge. Maybe you've seen some of them before and were wondering which features they have: well, now you can give them a go without paying a deposit or sharing your details.",
        "note": ""
      },
      "ELK Studios slots": {
        "text": "ELK's focus on high-quality graphics and engaging style of play is evident throughout its collection of slots games.\nThe award-winning Wild Toro is evidence of that, with its beautifully animated reels and rewarding bonus features. The Toro Walking Wild bonus gives you four respins as an enraged bull moves from reel to reel, and if the matador appears, it moves into Toro Goes Wild, where the animal attacks his foe leaving several wilds for the next respin. Once the matador and his colleagues have all been defeated, the bull calms down and the game continues. Wild Toro is an enjoyable slot for those who like a bit of action.\nMiss Wildfire is another ELK slot that has received rave reviews for its nice visuals and superb extras. The game revolves around a story of an alchemist whose experiments unleash potent prizes. As you might guess, Miss Wildfire is the wild that expands across the reels during free spins – you may get lucky and land the Super Miss Wildfire, which can spark a fire of wilds.\nAs well as these elaborate titles, ELK does also like to release the odd fruit machine game as an homage to the classic design of yesteryear, with Hit it Big and Hit it Hard being two examples of this. While the ELK blueprint is still there with a cool 3D design of a fruits machine, these are simple yet effective games that pay out on fruit combos and offer limited bonus features. The respin bonus is nice, though, and comes along quite frequently. ELK also offer several variations on the classic style, including titles such as Route 777 adding an interesting backdrop and soundtrack to jazz up the old-fashioned 7s and fruits symbols.\nELK's 'Mobile First' mantra means that all their slots are built to run just as well on mobile devices as on desktop computers, a necessary tool for today's players. This means many mobile-friendly casinos have ELK games as part of their selection.",
        "note": ""
      }
    }
  },
  {
    "title": "Evoplay",
    "logo": "https://static.casino.guru/pict/123974/Evoplay_white.svg?timestamp=1662360178000&imageDataId=368951",
    "provider_info": {}
  },
  {
    "title": "Ezugi",
    "logo": "https://static.casino.guru/pict/484/Ezugi.svg?timestamp=1653435842000&imageDataId=194361",
    "provider_info": {}
  },
  {
    "title": "Push Gaming",
    "logo": "https://static.casino.guru/pict/124088/PushGaming_white.svg?timestamp=1663496417000&imageDataId=374825",
    "provider_info": {
      "About Push Gaming games": {
        "text": "Push Gaming is a casino game provider that has made huge strides in recent years. Since its creation in 2010, it has gone from being an unknown entity to a rising star in the UK iGaming scene, with Push games having a reputation for absorbing gameplay and excellent graphics.\nDriving this growth is an ambition to compete with the big boys of the gaming world: they have acquired distributing firm GSI, formed an important partnership with SkillOnNet, and have expanded into key European markets in the last two years. To add to this, Push Gaming also underwent a complete rebranding to mark their ten years as a company, opting for a sleek, modern design to appeal to a wide audience of gamers.\nTheir expansion also led to an increase in gaming content as Push Gaming show off an ever-growing collection of titles, many of which they promote at important gaming events such as ICE Gaming in London.\nAll Push Gaming slot machines and casino games are held to extremely high standards, with the company holding key Malta and UK gaming licenses – in fact, Push have opened a second office in Malta to better comply with the licensing regulations. So, if you do play their games in one of the reputable Push Gaming casinos you can find Casino Guru, you can be sure of that their games have been tested for fairness.",
        "note": ""
      },
      "Push Gaming games": {
        "text": "On this page, you can try out some Push Gaming games for free, giving you the advantage of seeing if you like them before parting with your money. As you'll see, they focus on attractive graphics and some tempting prizes to get your attention.\nMystery Museum is one slot that scores highly in both design and gameplay. Your mission is to go deep into a haunting museum filled with treasure to find your prizes. There are three main features involving free games, mystery symbols and double up – the latter giving you the chance to ramp up your prize by choosing the correct card. An orchestral soundtrack adds to the excitement as you play.\nFor a game with a softer feel, then Wheels of Wonder is also an interesting slot to check out. It offers nearly 47,000 ways to win at its peak play level and offers features such as free spins with progressive multipliers. When you land a sequence across the six reels, the grid's blocks will crumble, leading to more falling from above which can lead to an exciting win sequence.\nKeep an eye on this page as Push Gaming continues to add to its collection over the next few years, and remember to gamble safely, especially if you do decide to play with real money!",
        "note": ""
      }
    }
  },
  {
    "title": "Eyecon",
    "logo": "https://static.casino.guru/pict/123976/Eyecon_white.svg?timestamp=1663484298000&imageDataId=374675",
    "provider_info": {}
  },
  {
    "title": "Saucify",
    "logo": "https://static.casino.guru/pict/124115/Saucify_white.svg?timestamp=1663484992000&imageDataId=374726",
    "provider_info": {}
  },
  {
    "title": "GameArt",
    "logo": "https://static.casino.guru/pict/123986/Gamerart_white.svg?timestamp=1663483857000&imageDataId=374650",
    "provider_info": {
      "Information about GameArt games": {
        "text": "GameArt is a popular slot game developer based in Malta that aims to produce fun, HTML-5-compatible titles for both desktop and mobile casino players.\nFormed in 2013, it became known for its quick rate of producing games, having averaged roughly one a month since then. Each one is designed to appeal to a wide audience, translated into many different languages and accepting over 60 currencies.\nGameArt has bolstered its reputation for safety by acquiring several gaming licenses from Italy, Curaçao, The Philippines and the USA (but not the Malta Gaming Authority certificate, despite its location) and provides 24/7 technical support to operators and players in case of problems.\nYou can try out a wide range of GameArt slots on this page, where you'll see artistic designs – hence the name – and easy-to-play reels that offer some interesting features and potentially big prizes. Many of them are video slots, which add that cinematic feel to the gaming experience, so go ahead and give them a spin for free: a great way to get to know the games without parting with any money.",
        "note": ""
      },
      "GameArt games": {
        "text": "GameArt's focus on artistic design is evident in many of their titles. Ali Baba's Riches is one of them, featuring elaborately detailed icons of thieves and treasures across its reels. You might know the Middle Eastern tale from your childhood, and this game gives you the chance to reenact it, with a desert adventure containing cascading wins, a Baba Bonus and mega symbols triggered by falling 'superblocks'. Free spins are also a big part of this game, offering you a chance for bigger wins.\nNext, as far away from the desert as possible, is Hawaiian Christmas; a game that, on the face of it, is a little bizarre. It features Hawaiian symbols, such as coconuts and pineapples, covered in snow, as well as a Tiki statue in a Santa hat that reacts to every win. The gameplay itself, however, makes more sense: features include expanding 7x7 reels during free spins, and cluster wins of 5 or more symbols that fill a 'Tiki meter': when full, this triggers multiplier wilds that are very interesting indeed.\nGameArt also have titles aimed at sports fans. Diego: El Pibe de Oro is an homage to soccer legend Diego Maradona and features a Latin soundtrack to accompany soccer-related reels. Look out for the Diego scatter wilds here, three of which will give you free spins, and five more during those spins will turn the lowest-paying symbol to a wild, as well as adding three extra spins.\nRemember that you can sort GameArt casino games according to several criteria on this page. Clicking 'Recently Added' lets you view the newest games at the top, while 'Highest RTP' will reorder them in terms of their likelihood of a high return.\nAlso, if you want to try GameArt games for real money, be sure to choose a good casino to play them on, something you can find out by checking out GameArt casinos page where we rate and review all of the relevant sites for you.",
        "note": ""
      }
    }
  },
  {
    "title": "SA Gaming",
    "logo": "https://static.casino.guru/pict/124112/SAGaming_white.svg?timestamp=1663496628000&imageDataId=374840",
    "provider_info": {}
  },
  {
    "title": "Endorphina",
    "logo": "https://static.casino.guru/pict/123968/Endorphina_white.svg?timestamp=1662360167000&imageDataId=368949",
    "provider_info": {
      "About Endorphina games": {
        "text": "Endorphina Inc. is an iGaming developer that has grown a lot since its inception in 2012. The Prague-based company has a global network of partnerships with software creators and internet gambling platforms, including a number of online casinos that offer Endorphina games.\nA key factor in its growth has been its modern approach to gameplay. Focusing on the popular slots market, their games have a fresh, dynamic look to them, and Endorphina are routinely considered for gaming awards because of this. They hold the Malta Gaming Authority license — a prestigious badge of honor in the iGaming industry — and they subject each game to rigorous testing by leading firm Gaming Labs Ltd to ensure safety and authenticity.\nWhile Endorphina are not in the same size bracket as the likes of NetEnt or Playtech, their varied content is popular with gamers, with their range of themes having something for everyone. Yet this commitment to specialized themes isn't always to everyone's taste: in 2017, the company were forced to pull their Maori-themed slots game from their collection after receiving complaints from the Maori population in New Zealand.\nDespite this unfortunate event, Endorphina still regularly produce exciting content, at a rate of at least 12 games a year, according to their website. You can play some of these titles for free on this page, and in the next section we're going to look at what you can expect from them.",
        "note": ""
      },
      "Endorphina games": {
        "text": "Endorphina's diverse slot selection covers a range of themes, from the classic fruit slot machines of yesteryear to modern sci-fi titles, so it's easy to find something to your taste when you browse through them.\nThe Rise of AI is one for fans of futuristic settings, featuring a cyberpunk theme set in the year 2050. While it's possible to win 25,000 times your stake via the game's fantastic random multiplier mechanism, there aren't many extra features to make use of. Instead, you simply need to find 3 or more matching symbols to trigger the prizes, with the devilish-looking robot symbol being the most valuable.\nEndorphina also show that they can cater for sports fans, including soccer and cricket themes in their stock. One, simply called 'Football', adopts a fun aesthetic of soccer symbols with faces – including yellow and red cards that shout at you whenever they land: although this might get annoying for those with their volume on full. Look out for the trophy (wild symbol) and the referee whistle (scatter), which lead to wins and free spins, while the 'Take Risk' feature lets you gamble your win by trying to 'beat the dealer' in a five-card chance game.\nThe traditionalists among us, meanwhile, will enjoy the classic Endorphina titles, such as Chance Machine 100 which displays the old-style 7s, BAR and bell symbols as modern jewel-encrusted versions. Like with many games like this, special features are at a minimum, but the gameplay is simple and effective. The Gold and Diamond Star symbols are the biggest payers, though, acting as the Scatters, while the Crown will give you the wild which expands vertically to form winning combos.\nAll games use HTML5 technology so you should be able to enjoy any of the titles on this page on your mobile device and on mobile-friendly casinos.",
        "note": ""
      }
    }
  },
  {
    "title": "BGaming",
    "logo": "https://static.casino.guru/pict/123935/BGaming_white.svg?timestamp=1663484552000&imageDataId=374691",
    "provider_info": {
      "Information about BGaming games": {
        "text": "BGaming is an established casino games provider from Belarus, hence the 'B' in its name. It started working on online games in 2012 but didn't launch its BGaming brand for another six years. These were to include virtual slots, video poker, lottery and card games designed to cater to a growing demand for internet play.\nThe company opened a new headquarters in Malta as part of its expansion, where it also acquired the Malta Gaming Authority (MGA) license to rubber stamp its dedication to high quality and good customer service. It also maintains a development office in Minsk, the Belarussian capital.\nBGaming's growing presence in the iGaming industry has led to several partnerships with leading casino operators who offer BGaming games. The company regularly features at top industry exhibitions like ICE London and iGB Live!, and has consistently looked to expand into new markets. Its acquisition of the Romanian and Swedish gaming licenses is evidence of this outlook.\nOne BGaming feature to look out for is its 'Provably Fair' tool with online casino games. With this, players can find proof that all BGaming titles are completely random, ensuring that they get fair treatment whenever they play.\nToday, BGaming boast a varied collection of video slots and casino games for you to play on, and regularly add new titles to the list. Read on to find out about some of their most prominent games, which you can play for free on this page.",
        "note": ""
      },
      "BGaming slots and games": {
        "text": "BGaming's game selection has two standout features: the first is that they tend to have a striking design which almost jumps off the screen. The second is their variety, with a range that encompasses historical, fantasy, sport and cartoon themes.\nAvalon: The Lost Kingdom falls into the fantasy category, and it's also one of BGaming's most popular slots. Set in the mythical medieval world of King Arthur, it has a clear layout of bright symbols across five reels. The best features are Fateful Wild and Excalibur: the first one involves you choosing a character to act as the Wild during the free spins that the feature gives you. Excalibur, meanwhile, gives you extra wilds across the reels when triggered. The game builds a tense yet enjoyable atmosphere, something that you might also see in other BGaming fantasy slots, like Book of Pyramids and Fire Lightning.\nFor something other than slots, BGaming also offer blackjack, video poker, roulette, and rolling dice. There's even a curious game called Plinko, which has one of simplest formats you can imagine. You simply enter your stake and wait for a ball to drop, or 'plink', down a pyramid of offset pegs into one of several holes containing different values. These can be as low as 20% of your stake (meaning you lose 80%), or as high as 29 times your stake, depending on the risk factor you choose. It's a pure game of chance, and enjoyable to play in free mode, too.",
        "note": ""
      }
    }
  },
  {
    "title": "Bally",
    "logo": "https://static.casino.guru/pict/123913/Bally_white.svg?timestamp=1663497366000&imageDataId=374913",
    "provider_info": {
      "Information about Bally": {
        "text": "Bally, or Bally Technologies, Inc., to give them their full name, have a long history in the gambling industry that stretches all the way back to 1932. Back then, Bally Manufacturing was formed to provide 'Ballyhoo' pinball machines to bars and arcades in Chicago, but they eventually expanded to slot machines — an association that continues today.\nFast forward several decades to the 1990s, and the company had split into two divisions: Bally Entertainment and Bally Gaming, with the latter responsible for developing casino games for land-based venues. Renamed Bally Technologies to embrace the digital age in 2006, they proved a success in the online market, which led to Scientific Games (SG) acquiring the company for a total of $5.1 billion in 2014.\nOne of the reasons SG were attracted to Bally was due to their expertise in producing quality gaming software, as well as their know-how of the gambling industry in general. The company has continued to excel as part of the SG brand, winning awards for its product innovation. Its content also follows strict quality control protocols as part of SG Digital's collection of licenses, including the MGA and UK Gambling Commission certificates.\nMany online casinos with Bally games on our database, and you can play a selection of them for free on this page. You can read about a few of these in more detail below.",
        "note": ""
      },
      "Bally casino games": {
        "text": "Bally casino games are known for their fun gameplay which appeals to a wide cross-section of the iGaming audience, even if their graphics are nothing to shout about. Many of their online slots stay loyal to the classic design of yesteryears, with the red 7s and bright fruits symbols that helped make the old-fashion reels such a success.\nTitles such as Hot Shot Progressive and Quick Hit are key examples of this, combining modern features and a traditional yet effective gaming method. Hot Shot's bonus features stand out, offering the players the chance to win Double and Triple Jackpots.\nBally also have several themed slots in their collection, including the 90s movie classic Titanic and a tribute to the 'King of Pop' Michael Jackson. Titanic offers players many bonus options, including 'pick-up', 'safe' and 'Jack's Drawing' features. The JackRose symbols serves as the scatter, and you can choose which level of the game to play by opting for a 1st, 2nd or 3rd class ticket — the possible jackpot of each varying accordingly.\nAnother Bally title with excellent bonus features is Dragon Spin. An Asian-themed slot with music to fit, you can land the Raining Wilds — a free game which sends wilds cascading down the reels — Persisting Wilds and a Reels Blast. However, the Mystery Stacked Wilds is perhaps the most intriguing where you get mystery symbols on each reel that can register big wins. The game is typical of Bally's dedication to entertaining gameplay, even if the graphics are pretty old-fashioned.\nDespite Bally's commitment to traditional casino games, they have embraced HTML5 technology which means you should be able to enjoy their titles on any device of your choosing, as well as in the growing number of mobile-friendly casinos online.",
        "note": ""
      }
    }
  },
  {
    "title": "Barcrest",
    "logo": "https://static.casino.guru/pict/123917/Barcrest_white.svg?timestamp=1663485304000&imageDataId=374750",
    "provider_info": {
      "Information about Barcrest games": {
        "text": "Barcrest are one of the most famous names in the UK gaming industry, both in bricks-and-mortar venues and the online world - and with good reason.\nTheir long history, stretching back to the late '60s, means they know how to make a popular slots game – from the old-style fruit machines that were a common feature of British pubs, to the modern electronic games that they release today.\nTheir success has led them to operate under different guises over the years, but always with the Barcrest symbol present. They started off as a division of Bass Plc, an old-fashioned brewing company until International Gaming Technology (IGT) bought them in 1998.\nUnder IGT, they ventured into the online world, and their excellent work there attracted industry titan Scientific Games (SG) to take them over in 2011. Barcrest's expertise in developing interactive games were a valuable addition to SG's virtual gaming division, and it's under this umbrella that we find their content today.\nMany online casinos offer Barcrest games to their customers, who find a selection of bright, well-designed titles at their disposal. The next section covers some of the most well-known Barcrest offerings, and what you can expect from them.",
        "note": ""
      },
      "Barcrest games": {
        "text": "If you're stuck for which Barcrest game to choose, then there are a few choice titles that stand out from the list and should offer an interesting playing experience.\nOne is 7s to Burn, a modern version of the classic fruits game that Barcrest made in a nod to their pub games of yesteryear. The game respects the old format enough so that if you put a gambler from the 1970s in front of it, he or she would be able to play, but the vivid colors and fiery digital background are much more modern that the slot machine of old. The burning 7s act as the wild here and can pay up to 250 times your stake if you get three on an active pay line.\nBarcrest also like to delve into history with some of their titles, and you'll see ancient figures like pharaohs, knights and emperors frequently among their games. Legend of the Pharaohs is one such game, an homage to the world of ancient Egypt, where you enter a pyramid and spin the reels to try and get your hands on the treasure. Like with most Barcrest slots, you can pay extra for a Big Bet feature which gives you five linked spins that might give you access to the Mega Pharaoh's bonus feature.\nFrom the rest of Barcrest's slot selection, you might have heard of Rainbow Riches, a game that was hugely successful upon its release in 2006. It borrows heavily from the world of 'lucky leprechauns', with prizes coming in the form of 'pots of gold'. You can play this, and its free spins version, in several Barcrest casinos listed on Casino Guru, or you can try it out for free on this page – that way, you get all the fun of a top slots game without parting with any of your hard-earned money.",
        "note": ""
      }
    }
  },
  {
    "title": "Wazdan",
    "logo": "https://static.casino.guru/pict/124158/Wazdan_white.svg?timestamp=1662360607000&imageDataId=369001",
    "provider_info": {
      "Information about Wazdan games": {
        "text": "Wazdan is a Malta-based iGaming provider that has over a decade's experience in creating online casino content available in over 300 accredited casinos with Wazdan games. The company currently employs over 150 people. From its island headquarters, it has expanded its customer base to many countries in Europe, South America and Asia, and its international standing is a key reason why it should be considered one of the prominent providers in the industry. Wazdan games are available in 24 languages and support all currencies and cryptocurrencies.\nPlayers enjoy Wazdan games because they offer a fun and safe gaming experience. The games use a GLI-certified random number generator, which guarantees a reliable, fair and secure gameplay. Its creative staff launches quality slot titles on a regular basis and the company has won a rather large number of prestigious awards for their work, including 'Online Casino Innovator 2018' award at CEEG and 'Malta's Best iGaming Online Product of the Year' award at MiGEA 2019 to name a few.\nGames offered by Wazdan are licensed by the Malta Gaming Authority (MGA), the United Kingdom Gambling Commission (UKGC), as well as by a large number of local licenses, which contributes to its good reputation.\nAs of 2025, Wazdan has well over 140 slots to choose from, some of which it showcases at famous iGaming exhibitions around the world. All of the games use HTML5 technology, a practice Wazdan started to offer in 2016, so players can enjoy them on any device of their choosing.\nWith some useful strategic partnerships and a large customer base, Wazdan could well continue its expansion over the coming years. Keep an eye out for new releases from them, and feel free to try out their games for free on this page.",
        "note": ""
      },
      "Wazdan games": {
        "text": "Wazdan's frequent slot game output has created a collection of eclectic titles that are powered by high-quality feature-rich software. The provider's Multiways mechanics is a prime example of these features, offering players up to 60,000 ways to win.\nPower of Gods: Medusa is one of the newer Wazdan titles and features the infamous snake-hair mythical goddess. Played on a 5x3 grid, the game is popular for its Hold The Jackpot feature, triggered once a player lands 6 or more Bonus symbols. The Bonus and Jackpot symbols award prizes ranging from 1x-150x. The game also features Medusa, Mystery and Medusa Mystery symbols, each one offering additional benefits for the Bonus Game and increasing your total win. If you manage to collect all 15 Bonus symbols, the GRAND Jackpot of 2000x player's bet is won. Eligible players can also purchase the bonus round directly through the game, choosing from different levels of volatility. A maximum win of up to 2500x player's bet is set.\nAnother Wazdan title that is quite recent and benefits from great graphics and candy-sweet atmosphere is Jelly Reels. Played on an 8x8 grid, the game offers an exciting ride full of mega symbols, wilds and respins, along with 16,777,216 ways to win. The game also features the Hold the Jackpot feature. Should you collect all 40 Bonus symbols, the GRAND Jackpot of 2500x player's bet is won. Since a maximum win of up to 2500x player's bet is set, The GRAND Jackpot is the maximum prize in the game.\nWazdan slots come with special modes that you can select depending on your playing style. Many of them come with 'Ultra Lite' mode, for example, which drastically reduces loading times for players with slow internet speeds. 'Ultra Fast' mode, meanwhile, gives you a super boost in reel speed and 'Volatility Level' lets you move between high and low volatility - before you use this last one, though, it's a smart idea to read our article on games of chance to get a better idea of how they work.\nFans of the traditional casino table games can also try out roulette, blackjack and poker titles in Wazdan's collection. These all offer the smooth gameplay that the company is famous for.",
        "note": ""
      }
    }
  },
  {
    "title": "PariPlay",
    "logo": "https://static.casino.guru/pict/124070/PariPlay_white.svg?timestamp=1663484887000&imageDataId=374722",
    "provider_info": {
      "Information about Pariplay games": {
        "text": "Pariplay came into being back in 2010 and has targeted the flourishing iGaming market ever since. Over that time, it's extended its presence to many different countries, including Malta, Israel, Gibraltar, and the USA. It has also acquired a collection of licenses, with the MGA and UKGC certificates possibly being the most notable.\nIn 2022, Neogames acquired Pariplay as part of its takeover of Aspire Global, helping it become a major force in the iGaming industry. As part of Neogames, Pariplay has strengthened its operations, winning EGR awards along the way, and expanding the number of casinos with Pariplay games.\nIts main products are the Fusion Aggregation Program, which allows operators to host thousands of games, and its Ignite Studio development tool which helps developers produce content. The company has also developed an extensive collection of Pariplay games, which is what this page is dedicated to.\nThe Pariplay game studio, which in 2021 rebranded to Wizard Games, has a lot of treats waiting. Continue reading to find out more about the top Pariplay online slots on our database, plus their bonus features and how you can play them.",
        "note": ""
      },
      "PariPlay games to check out": {
        "text": "Like many game providers, Pariplay has used the special Megaways technology to create several entertaining Pariplay slots games. Its Megaways titles include Rumble Rhino and Dragons of the North. These are good places to start, as they let you experience the enhanced reels and thousands of ways to win but in Pariplay's own style.\nAway from the Megaways brand, Pariplay also has some great original slots games to try out, with Gods of Kemet, Book of Enchantments, and Pot O' Gold standing out. Each of these features mystical figures and an air of adventure. Gods of Kemet, for example, takes us on a trip to ancient Egypt with decorative icons of that period and some traditional music thrown in. It comes with three levels of super bonuses; Minor, Mega, and Major; which you may be able to take advantage of if you're lucky.\nIf you're not so keen on such fancy titles and want something a little more down-to-earth, Pariplay also does a nice line in classic games. 12 Super Hot Diamonds, Hot Wild 7s, and Flamin' 7s all use the classic slots format of fruit symbols and red 7s to offer players an uncomplicated gameplay and basic features. While these games are more familiar to many people, they tend not to offer prizes as lucrative as in other slots and are probably not among Pariplay's best slots.\nYou may not wish to play slots at all. If that's the case, Pariplay has a small collection of other types of casino games to choose from. American Roulette is one of them, offering a sharp design of the classic roulette table, with a snappy soundtrack and smooth gameplay.\nYou can play any of the above games for free on this page. Simply select the one you like the look of and start spinning. We advise you to start off playing for fun as a way of learning about the game rules and seeing whether you enjoy it before committing your own funds.\nRemember, it's better to play for enjoyment's sake rather than to win money. This page will help you do that.",
        "note": ""
      }
    }
  },
  {
    "title": "Lightning Box",
    "logo": "https://static.casino.guru/pict/124039/Lightningthebox_white.svg?timestamp=1663496376000&imageDataId=374823",
    "provider_info": {
      "About Lightning Box": {
        "text": "Lightning Box is an online slots developer based in Sydney, Australia that was founded in 2004.\nAs well as developing online slots, Lightning Box also offers customized game design services for online casinos, allowing them to partner with the company to create bespoke slot games that fit in with their style.\nLightning Box's attention to detail means that it's known for creating top-quality slot games that have been a hit among players worldwide. This is thanks to the work of a team of experienced designers and game mathematicians who work together to develop captivating and distinctive slot games.\nThe company's game collection includes more than 70 titles, which are available at numerous Lightning Box online casinos in various jurisdictions.\nLightning Box's top-rated games such as Silver Lion, Astro Cat, and Dragon Palace stand out for their exceptional graphics, engaging features, and immersive gameplay. The next section will explore what makes these games so popular and how you can play them for free on Casino Guru.",
        "note": ""
      },
      "The best Lightning Box games to check out for free": {
        "text": "Lightning Box casino games mainly consist of slots, but there is enough diversity in between these to keep you entertained for hours should you wish to play them for fun.\nSilver Lion is one such example. Set in the African savannah, it features great graphics and immersive sound effects. The game includes a range of exciting features, such as free spins, multipliers, and stacked symbols, which makes it a favorite among players.\nStaying with a cat-related theme, Astro Cat is an Asian-inspired game that has a different type of feline main character. It has a unique six-reel layout and a whopping 1296 ways to win, all of which come with under the watchful eye of the Astro cat himself.\nDragon Palace is a different take on Asian culture, set in a mythical Chinese palace and features intricate artwork and traditional Chinese music. The game includes free spins, wilds, and multipliers, which can combine to create big payouts. The game's main feature is designed so that winning combinations can be formed from left to right and right to left, increasing the chances of winning.\nAs mentioned above, there's no need to pay money to play these games thanks to this page. You can use our sorting tools and filters to locate the Lightning Box games that best suit your tastes, then play on them for free.\nTo use a couple of examples, when 'Recommended' is highlighted in the drop-down menu, you'll see the most highly-rated games at the top of the list. Selecting 'Recently added' meanwhile will put the newest Lightning Box slots at the top. Click on 'Advanced filters' to narrow the games down by their theme or number of reels.\nOnce you've found one you like the look of, simply click 'Play for Free' to try it out at no cost!",
        "note": ""
      }
    }
  },
  {
    "title": "Habanero",
    "logo": "https://static.casino.guru/pict/124002/Habanero_white.svg?timestamp=1662360231000&imageDataId=368959",
    "provider_info": {
      "Information about Habanero games": {
        "text": "Habanero is a leading software and games provider based on the island of Malta. Since receiving financial backing from a consortium in 2012, it has built an impressive portfolio of online slots and table games, as well delivering an efficient iGaming platform to operators.\nPart of Habanero's strategy has been to form partnerships with important operators and other gaming platforms to expand their scope and bring players innovative casino content at the same time. At the time of writing, the company has offices in several different continents, including Asia and Africa, and a large team of specialists who help ensure a consistent high-quality output of material.\nBy 2020, the company boasted a portfolio of well over 100 games, all of which used HTML5 technology so players could enjoy them on a variety of devices. Their titles had also featured at some leading exhibitions, such as ICE London, and several gaming ceremonies.\nAll Habanero games are subject to strict regulation overseen by the likes of the respected Malta Gaming Authority and the UK Gambling Commission. They also abide by Random Number Generator (RNG) guidelines so that players can be sure all results are totally random.",
        "note": ""
      },
      "Habanero Games": {
        "text": "Habanero aims to ensure smooth, high-quality gameplay in all its titles, regardless of the device players use. For this reason, we often see them in mobile-friendly casinos with operators confident that players won't experience any drop in quality compared to desktop versions.\nSlots by Habanero tend to have a bright, jovial feel to them and many of them revolve around popular celebrations, such as Christmas and Halloween. Santa's Village is one such slot, a beautifully-designed festive affair that offers engaging gameplay and a range of bonus features. Each winning spin puts Santa closer to reaching a house – when he does, he activates free spins and even rides across the screen in his sleigh to celebrate.\nHabanero are also able to showcase their dark side, however. London Hunter is a good example of this: set in Victorian England, it takes us on a curious gothic adventure as a team of hunters chase after an escaped T-Rex. The game is full of special effects that roar into life every time you hit a combo: the highlight is the free spins feature which can trigger multipliers and therefore big wins.\nIf it's a food-based game you're after, then Cake Valley is a fun Habanero slot that offers up tasty prizes as well as delicious-looking cake symbols. Like with most Habanero games, it's nice to look at: set on a glacial background to cheerful music. One of the main aims is to get the 'Jelly Selector' feature where coloured treats appear behind the reels – you get a certain number of free spins depending on which colour appears.\nFans of traditional casino table games will also be pleased to see that Habanero have a range of blackjack, poker and roulette titles in their collection. Titles like Joker Poker and Jacks or Better offer a colourful, if slightly dated variant, on classic card games, and the general standard of gameplay is high among them.",
        "note": ""
      }
    }
  },
  {
    "title": "Red Rake Gaming",
    "logo": "https://static.casino.guru/pict/124100/RedRake_white.svg?timestamp=1663483951000&imageDataId=374656",
    "provider_info": {}
  },
  {
    "title": "Leander Games",
    "logo": "https://static.casino.guru/pict/124035/Leander_white.svg?timestamp=1663484867000&imageDataId=374720",
    "provider_info": {}
  },
  {
    "title": "Rabcat",
    "logo": "https://static.casino.guru/pict/124094/Rabcat_white.svg?timestamp=1663496988000&imageDataId=374872",
    "provider_info": {}
  },
  {
    "title": "Spinomenal",
    "logo": "https://static.casino.guru/pict/124138/Spinomenal_white.svg?timestamp=1663483223000&imageDataId=374625",
    "provider_info": {}
  },
  {
    "title": "1X2 Gaming",
    "logo": "https://static.casino.guru/pict/123882/1x2gaming_white.svg?timestamp=1663483611000&imageDataId=374636",
    "provider_info": {
      "Information about 1x2 Gaming games": {
        "text": "1x2 Gaming is an online gaming developer based in the UK. It produces sports betting and casino games as part of the 1x2 network, and is most famous for its Virtual Football series.\nSince its formation in 2002, 1x2 Gaming has concentrated on expanding its product range, including almost every type of casino game. To do this, it has built up a large network of partnerships with iGaming operators, including many online casinos that offer 1x2 games.\nVirtual slots make up the majority of 1x2's gaming stock with titles such as Van Helsing: Book of the Undead and Book of Merlin earning favorable reviews from players and industry experts alike. You'll find a wide selection of them to play for free on this page, along with roulette, blackjack and video poker games.\n1x2 Gaming underwent a full rebrand in 2017 to become known as the 1x2 Network. The company now releases content via a new subsidiary Iron Dog Studio that works alongside 1x2 Gaming. This brand focuses on high production slots released into European markets including Malta, Gibraltar and Italy.\nThe company's international outlook explains why they have a string of important gaming licenses, including certification from the Gambling Commission (GC) and the Malta Gaming Authority (MGA). While these licenses don't guarantee a perfect playing experience with 1x2 Gaming content, it does hold them to very high gaming standards.",
        "note": ""
      },
      "1x2 slots and casino games": {
        "text": "Fans of variety will like 1x2's gaming selection, which includes a range of styles from horror to happy Christmas-themed games.\nThe Book of Merlin is one that may appeal to fans of the famous wizard, with its setting in a magical library of self-writing books. The game's design is nice and sharp, without it being anything special, and it offers some fun bonus features. Landing three or more potion book symbols will get you at least 10 free spins, during which you could trigger an additional bonus round where an ancient book opens on the reels to reveal your fortune. Look out for the wizard wild symbol, too, which can expand to land you even more free spins.\nIf you're looking for something a little more down to earth, or even under the earth, then Under the Sea takes us beneath the waves to a relaxing underwater world. A soothing soundtrack plays as we spin the reels, and different types of marine wildlife can win different prizes. The turtle acts as the scatter symbol: three of these will lead to a win and several free spins, with the prize improving should you get more of the shelled creatures. The clownfish, made famous by Disney's Finding Nemo, is also useful, replacing other fish to create extra winning lines.\nHowever, you don't just have to play slots. 1x2 does well in presenting a diverse stock of games. If you're a sports fan, then you may like its Virtual Football series, that gives you the chance to get instant wins from fixed-odds virtual soccer games, while casino games like Roulette Diamond and Blackjack Players Choice are also fun options.",
        "note": ""
      }
    }
  },
  {
    "title": "Booming Games",
    "logo": "https://static.casino.guru/pict/123944/Boominggames_white.svg?timestamp=1663485219000&imageDataId=374742",
    "provider_info": {}
  },
  {
    "title": "2By2 Gaming",
    "logo": "https://static.casino.guru/pict/123884/2by2_white.svg?timestamp=1663496875000&imageDataId=374862",
    "provider_info": {}
  },
  {
    "title": "Tom Horn",
    "logo": "https://static.casino.guru/pict/124150/TomHorn_white.svg?timestamp=1663484438000&imageDataId=374681",
    "provider_info": {
      "Information about Tom Horn games": {
        "text": "Should you Google \"Tom Horn\", you'll get the story of a Wild West outlaw. Scroll down, however, and you'll come across Tom Horn Gaming, a software provider who we can only presume was named after the famous cowboy.\nTom Horn Gaming started life as Tom Horn Enterprise, but underwent a name change in 2016 when it also acquired its Malta Gaming Authority (MGA) license. It was also the first-ever regulated content supplier in Lithuania at this point, which gave it a special kind of credence.\nOver the next few years, it also acquired the UK Gambling Commission (GC) license and won several awards across Europe for its content. These certificates and awards act as proof that the company operates in a fair and secure environment and follows strict industry standards.\nTom Horn games started to go live in new countries following the pandemic, with the company entering the Slovak, Spanish, and Czech markets. Their quality is down to a dedicated team of experts who possess a deep understanding of the industry and its ever-evolving trends.\nProminent releases include Book of Spells, Dragon Egg, and Flaming Fruit, all of which showcase the variety of Tom Horn games. We'll cover this in more detail in the next section.",
        "note": ""
      },
      "Tom Horn slots and casino games to look out for": {
        "text": "Tom Horn has a diverse offering of games but, like many providers, it has a focus on slots. You can try out some of the best Tom Horn Gaming slots in demo mode on this page and we'll take you through a couple of them to give you an idea of what to expect.",
        "note": ""
      },
      "243 Crystal Fruits": {
        "text": "243 Crystal Fruits is one example of Tom Horn games. It offers a modern twist on the classic fruit-themed slots. While it has fruit symbols, they're not ones you might expect, with bold and crisp animations taking the place of the standard cherries and bananas.\nThe \"243\" in the title refers to the 243 ways to win, and the game features expanding Wild symbols and a re-spin feature. Like many slots, this game moves quickly, so take care not to become too immersed and forget how much you're spending: remember to try and follow responsible gambling practices at all times.",
        "note": ""
      },
      "Blackbeard's Quest": {
        "text": "Blackbeard's Quest is a different type of Tom Horn slot, taking players out on stormy seas with the infamous pirate of old. The game boasts impressive visuals, bringing the pirate theme to life.\nIts highlight is the Free Spins feature, where players can uncover hidden treasures, much like Blackbeard himself did – still, the chances of winning anything as valuable as those treasure chests are very low indeed!",
        "note": ""
      },
      "European Roulette": {
        "text": "It's not all about Tom Horn slots, of course. This provider also has non-slots offerings including European Roulette – Announced Bets, based on the famous wheel and ball casino game.\nThere's nothing special about this game, though – it simply offers a standard roulette game – but it does show that Tom Horn can extend its hand to other casino games.",
        "note": "Remember that you can play all these Tom Horn games for free on this page. This is a great way to find one that you like before playing for real money, or you could just continue playing for fun and not risk a single cent."
      }
    }
  },
  {
    "title": "Iron Dog Studio",
    "logo": "https://static.casino.guru/pict/124017/IronDog_white.svg?timestamp=1663485452000&imageDataId=374765",
    "provider_info": {}
  },
  {
    "title": "Realistic Games",
    "logo": "https://static.casino.guru/pict/124096/realistic_games_dark.png?timestamp=1653406144000&imageDataId=127688",
    "provider_info": {}
  },
  {
    "title": "Genesis Gaming",
    "logo": "https://static.casino.guru/pict/123996/Genesis_white.svg?timestamp=1663483819000&imageDataId=374648",
    "provider_info": {}
  },
  {
    "title": "High 5 Games",
    "logo": "https://static.casino.guru/pict/124006/H5_white.svg?timestamp=1662360218000&imageDataId=368957",
    "provider_info": {}
  },
  {
    "title": "Ash Gaming",
    "logo": "https://static.casino.guru/pict/123909/AshGaming_white.svg?timestamp=1663498162000&imageDataId=374987",
    "provider_info": {}
  },
  {
    "title": "Belatra Games",
    "logo": "https://static.casino.guru/pict/13310/Belatra_white.svg?timestamp=1663498096000&imageDataId=374981",
    "provider_info": {
      "About Belatra Games": {
        "text": "Belatra Games is a software development company with a rich history in the gaming industry. Founded in 1993, Belatra Games first specialized in manufacturing electronic gaming machines for land-based casinos. The company was headquartered in Minsk, Belarus from where it shipped these products and gained recognition for innovation and high quality.\nIn the early years, Belatra Games focused on the local market, catering to the growing demand for gaming machines in Belarus and neighboring countries. By the late 1990s, it had started to build a strong international presence and supplied gaming units to casinos worldwide.\nIt was from these foundations that Belatra Games adapted to the changing landscape of the gaming industry in the early 2000s. The company switched its focus to supplying Belatra online casinos and carved a niche in the online gambling market.\nSince then, Belatra Games has continued to diversify its product offerings. They have expanded their portfolio to include various casino games, including slots and roulette.\nIf you'd like to know more about the Belatra slots online available out there, then check out our next section which delves into some of its most popular titles.",
        "note": "Today, Belatra Games' products are featured in numerous online casinos and enjoy a positive reputation for their gaming content."
      },
      "The best free Belatra slots to try out": {
        "text": "When confronted with a list of free casino games to choose from, what do you do? Maybe you choose the first one you like the look of, or perhaps you go for the one with the highest RTP?\nOn this page, you can do both. You can rearrange the list of Belatra games you see according to specific criteria (including the highest RTP) on the drop-down list at the top of the menu. If you'd like more specific guidance, though, here are a few Belatra Games slot reviews of some of the company's most popular titles.\nCrystals Digger is one example of engaging Belatra slots. It revolves around the theme of underground exploration, featuring hidden dungeons and precious gemstones.\nThe game allows for a wide range of betting options, with a minimum bet of $20 and a maximum bet of $10,000 in the demo version of the game. Landing at least 8 matching symbols results in winning combinations, with the highest-paying symbol being the red firestone.\nAlso, check out features, such as free spins and a Wheel of Fortune (Jackpot). The free spins are triggered by landing 4 or more scatter symbols, awarding up to 10 free games, while you must accumulate JP points to access the jackpot game.\nIf you're a sci-fi fan, then Big Bang: The Universe may be one of the Belatra slots that appeal to you. This game takes players on a journey into the realm of space and aliens and features 8 reels and 20 pay lines.\nWith a high volatility level, Big Bang: The Universe offers the potential for significant wins, although it also increases the chances of you losing a large amount if playing for real money.\nThis Belatra slot has various exciting features, including free spins and a bonus round. These features add depth and excitement to the gameplay, which goes well with its nice design and entertaining soundtrack.\nRemember, this page isn't just limited to Belatra slots. You can also try out Belatra roulette games by clicking the 'Roulette' tab at the top of the page. Here, you'll find three titles – Lucky Roulette, European Roulette, and American Roulette – that you can play in demo version just by clicking on the 'Play for Free' button, the same as with all the other Belatra casino games listed on this page.",
        "note": ""
      }
    }
  },
  {
    "title": "NeoGames",
    "logo": "https://static.casino.guru/pict/658/NeoGames.svg?timestamp=1653435905000&imageDataId=194426",
    "provider_info": {}
  },
  {
    "title": "Booongo (BNG)",
    "logo": "https://static.casino.guru/pict/123946/Booongo_white.svg?timestamp=1663484057000&imageDataId=374662",
    "provider_info": {
      "Information about Booongo games": {
        "text": "Booongo is a game studio that specializes in creating cross-platform HD video slots for the online gambling market.\nFounded in 2015, it lacks the experience of many of its competitors, but it has created a reputation for designing vibrant games that boast cutting-edge gameplay elements.\nIts game range includes both 2D and 3D HTML slots which operate on both desktop and mobile devices. The company also offers a Remote Game Server (RGS) and back-office solution that they sell directly to game operators.\nSince its founding, Booongo has set up an office in Curacao, where it holds the Curacao Gaming license. While not as widely respected as other certificates, the license ensures that Booongo follow certain safety and quality assurance standards. It also has an office in Taiwan, where it's part of the growing Asian online gaming industry.\nYou can try out some of Booongo's slots for free on this page, and the next section will guide you through some of its most notable releases.",
        "note": ""
      },
      "Booongo games": {
        "text": "Booongo slots encompass a wide range of themes designed to keep players entertained. Many of them show off an Asian theme, in homage to one of the company's main markets.\n88 Dragon, Shen Long Mi Bao and Happy Chinese New Year all feature ancient Chinese symbols and a soundtrack of traditional music, while there's even a game dedicated to the Chinese God of fortune, Cai Shen. Fu Cai Shen is an old-school slot that doesn't come with many special features, but the game is easy to play and boasts an eye-catching design.\nIf you're looking for something a little more action-packed, then Booongo's line of video slots has something for everyone. Nord's War, a thriller with great effects and a captivating soundtrack, is a popular choice. It has some nice extra features, including free spins where the two Wilds symbols (the Viking and Knight) become nudging Wilds and open up more winning opportunities. God's Temple and Vikings Gods Gold are other video slots that follow a similar theme.\nIt's not all blood and thunder with Booongo, though. You'll also find a collection of softer animated games, like 12 Animals and Singles Day. These titles opt for a more relaxed approach, featuring cute animals and light-hearted music. While Singles Day is pretty standard, 12 Animals stands out with its striking visuals and array of features. The most common of these is the Sticky Win feature landed after a winning combo: here, all winning symbols stay locked in place during a respin. If you get new winning symbols, then you will get more spins, and this will repeat until you fail to land further winners.",
        "note": ""
      }
    }
  },
  {
    "title": "Relax Gaming",
    "logo": "https://static.casino.guru/pict/124106/Relax_white.svg?timestamp=1663484723000&imageDataId=374710",
    "provider_info": {
      "Information about Relax Gaming games": {
        "text": "Since Relax Gaming's formation in 2010, it has followed a steady trajectory which has seen it go from a start-up led by two entrepreneurs to an established gaming provider.\nDespite this, it was a slow start for Relax. It didn't release its first product, a poker game, until March 2014, a full four years after the company's inception. It was another four-and-a-half years before the world saw Erik the Red, Relax's first slots game, although it had opened three new offices in that time, including one in Malta.\nTheir new home in Malta served as a gateway into that popular market, where it holds the Malta Gaming Authority (MGA) license, as well as a string of other top certificates from the Gambling Commission (GC), and Gibraltar and Alderney authorities.\nRelax didn't rest on its laurels, though. It increased its gaming output, made an innovative casino platform available to operators and opened another two offices in Stockholm and Belgrade to boot.\nIt all led to Kindred Group, a large iGaming operator snapping up almost $385 million-worth of shares in June 2021 to acquire Relax Gaming and combine the forces of the two entities.\nRelax's prolific output means that you are likely to stumble across some of their games in various Relax Gaming casinos on our database. The next section explores some notable titles in their stock.",
        "note": ""
      },
      "Relax Gaming slots and casino games": {
        "text": "Slots form the backbone of Relax Gaming's collection, and its team of developers make bold designs and adventurous gameplay a recurring theme. They also like to spice things up now and then by producing a Megaways slot, games which are famous for their thousands of ways to win.\nTemple Tumble is a prime example of this, an Indiana Jones-inspired venture into an ancient Aztec temple. Like with all Relax Gaming slots, it starts with an action sequence that builds the excitement, and the game itself does a good job of keeping things interesting. It has reels that cascade as stone blocks to form different combos, some of which may lead to a Big Win, Mega Win or Epic Win. Each time you win, you destroy blocks; if you clear the reels of blocks, you'll trigger the free spins bonus game.\nIf you're looking for a more light-hearted approach, then the Great Pigsby is an eye-catching title that offers some fun features, although it isn't a Megaways slot. Inspired by F. Scott Fitzgerald's famous novel, it showcases all the glitz and glamor of the 1920s in the USA, with the reels superimposed onto a mansion of that time. Look out for the Great Pigsby symbol here, as well as the pig version of Daisy Buchanan. The game claims to have 243 different ways to win, but, of course, that doesn't mean you're guaranteed to.\nRelax also offers roulette and blackjack games as part of its collection. These are nicely designed and fun to play, without offering anything ground-breaking. Instead, they just let you play the classic games without any complications.",
        "note": ""
      }
    }
  },
  {
    "title": "MrSlotty",
    "logo": "https://static.casino.guru/pict/124049/MrSlotty_white.svg?timestamp=1663485338000&imageDataId=374752",
    "provider_info": {}
  },
  {
    "title": "edict",
    "logo": "https://static.casino.guru/pict/535/edict.png?timestamp=1653435303000&imageDataId=193910",
    "provider_info": {}
  },
  {
    "title": "MultiSlot",
    "logo": "https://static.casino.guru/pict/396/MultiSlot.svg?timestamp=1653435843000&imageDataId=194366",
    "provider_info": {}
  },
  {
    "title": "TOPTrend Gaming",
    "logo": "https://static.casino.guru/pict/124152/TopTrend_white.svg?timestamp=1663483669000&imageDataId=374640",
    "provider_info": {}
  },
  {
    "title": "Greentube",
    "logo": "https://static.casino.guru/pict/124000/green_tube_dark.png?timestamp=1653406086000&imageDataId=127657",
    "provider_info": {}
  },
  {
    "title": "SG Interactive",
    "logo": "https://static.casino.guru/pict/637/SGinteractive_white.svg?timestamp=1663498273000&imageDataId=374997",
    "provider_info": {}
  },
  {
    "title": "Genii",
    "logo": "https://static.casino.guru/pict/123998/Genii_white.svg?timestamp=1663485375000&imageDataId=374757",
    "provider_info": {}
  },
  {
    "title": "Arrow's Edge",
    "logo": "https://static.casino.guru/pict/123906/Arrowsedge_white.svg?timestamp=1663485240000&imageDataId=374744",
    "provider_info": {}
  },
  {
    "title": "Ainsworth",
    "logo": "https://static.casino.guru/pict/123898/Ainsworth_white.svg?timestamp=1663484652000&imageDataId=374702",
    "provider_info": {
      "Information about Ainsworth games": {
        "text": "Ainsworth Game Technology, otherwise known as just AGT, is an Australian gaming manufacturer that provides products to both the land-based and internet gambling industries.\nIt was founded by Len Ainsworth in 1995. Ainsworth was already a successful businessman, having set up one of the world's largest gambling machine companies in Aristocrat Leisure. His new venture took off in a similar way to his original company, mass-producing land-based gaming terminals, such as slot machines.\nIn 2016, Ainsworth opened a huge new office in gambling capital Las Vegas, where it had easy access to Sin City's insatiable demand for gambling products. By this time, Ainsworth had already branched out into the online world, manufacturing virtual slots that retained the classic feel of land-based games.\nDespite the old-fashioned style of its games, the company has proved savvy at making key partnerships in the digital world. It has a heavy presence in Latin America through its partnership with Salsa Technology. Ainsworth subsidiary Mustang Money is a major player in the Mexican market, for example.\nThe company's success turned the head of iGaming giant Novomatic in 2018, and they bought a 52% stake to become Ainsworth's majority shareholder: they had bought out Len Ainsworth himself.\nToday, Ainsworth is prospering under the Novomatic umbrella of companies, despite some tough times during the pandemic. Many Ainsworth casinos offer its games to their customers, and you can try these out for free on this page.",
        "note": ""
      },
      "Ainsworth slots": {
        "text": "If you like classic slots games, then Ainsworth games will appeal to you, with their no-nonsense gameplay and neat but basic designs. On the other hand, fans of the latest slot technology, like imaginative bonus features and cinematic opening sequences, might be a little disappointed.\nMost Ainsworth slots revolve around a typical 5-reel format, featuring common symbols based on the most valuable symbols in a pack of playing cards: Jack, Queen, King, and Ace. Stormin' 7s is a good example of this, playing on the popularity of the red ‘7' symbol on slot machines. A nice feature to look out for here is the Free Game Bonus which is triggered by three or more scattered Diamonds. This will give you 10 games during which you can win a wide range of prizes.\nYou also can't fail to notice Ainsworth's obsession with animals within its slots selection. Monkeys, wolves, oxen, tigers, cats, and parrots are all catered for; the trick is knowing which one to pick. Unfortunately, a few of them, such as Dragon Lines, Eagle Bucks, and Panda King score badly among Casino Guru's team of reviewers. Despite some pretty designs in places, their unimaginative features, low RTP, and simple gameplay mean that you might be better off trying other slots if you're after something more elaborate.\nOne thing that Ainsworth does have in its favor is a focus on HTML-5 technology. We know this is standard these days, but you should be able to play any of their slots on the mobile device of your choice without a drop-off in quality.",
        "note": ""
      }
    }
  }
]